{"series": "7", "episode": "11", "transcript": ["Scene: The apartment. Penny and Amy are playing a ski-ing game.", "Penny: Wow, you’re really good at this.", "Amy: Well, I have an extremely low centre of gravity. I’m like a pyramid.", "Penny: How you doing over there?", "Leonard: Oh, I hope it’s just a sprain. I cannot walk into that E.R. with another video game injury.", "Penny: Hey, Sheldon, you want to play next?", "Sheldon: Oh, I would, but I’m on my way out.", "Leonard: Where?", "Sheldon: Texas.", "Amy: Right now? Why?", "Leonard: Is someone sick?", "Sheldon: Yes. My sister’s uterus came down with a baby.", "Penny: Oh, she’s pregnant? That’s great. You’re gone an uncle. Uncle Sheldon.", "Sheldon: No, I will be Uncle Dr. Cooper.", "Amy: How come you never said she was pregnant?", "Sheldon: Well, I never told you about my brother’s kidney stone. You want to hear about everything that comes out of my family’s genitals?", "Leonard: Well, congrats, and it’s nice you’re gonna be there for your sister.", "Sheldon: Yes. I’m filling in for her husband who’s recovering from a horrible motorcycle accident. Lucky duck.", "Penny: Wow, so, how long will you be gone?", "Sheldon: Well, she’s due tomorrow. Although it did take her six years to finish high school, so who knows?", "Amy: Can I give you a ride to the airport?", "Sheldon: Oh, no, thank you, I don’t want to be an inconvenience. Chop-chop, Leonard. We leave in ten minutes.", "Credits sequence.", "Scene: The apartment.", "Leonard: All right, here’s the deal. Sheldon is gone, so the tree decorating rules are out the window.", "Penny: Yeah, which means we don’t have to use his ridiculous ornament-spacing template.", "Leonard: And I’m happy to report its kickstarter campaign is holding strong at zero dollars.", "Penny: Ah.", "Raj: Wait, so Star Wars and Star Trek characters can go on the same branch?", "Leonard: I know, it’s crazy. Welcome to the Thunderdome, people. (All whoop)", "Howard: I’ve never done this before. It’s kind of fun.", "Raj: Yeah, if your mom could see her little Bar Mitzvah boy right now, she’d have a heart attack.", "Bernadette: Good idea, I’ll take a picture.", "Penny: Honey, I’m a little strapped for cash this year, so for Christmas I was thinking of giving you this.", "Leonard: I love it.", "Penny: Okay.", "Leonard: But it is what you got me last year.", "Penny: Yeah.", "Leonard: And last night.", "Stuart: Hello.", "Various: Hey, Hi, Stuart. etc", "Stuart: Oh, good, I’m glad you guys didn’t wait for me to start. Although you said seven and it’s, it’s seven, but that’s fine.", "Amy (ringing from tablet): Oh, it’s probably Sheldon. Hi, Sheldon. Everybody’s here, say hi.", "Penny: Hi. ", "Leonard: Hey, buddy.", "Raj: Hey.", "Howard: Howdy.", "Bernadette: Hi.", "Stuart: Hello.", "Sheldon: The second I go out of town you throw a Christmas party without me? ", "Amy: Yeah, kinda.", "Sheldon: That’s so thoughtful. You guys are the best.", "Penny: Hey, how’s your sister?", "Sheldon: <i>She went into labor an hour ago.", "Amy: That’s wonderful. So you’re at the hospital?", "Sheldon: No, she chose to have a home birth because she wants to live in the Stone Age and a cave wasn’t available.", "Raj: You know, many people believe that home births are better because the mother is in a warm, comfortable environment where she can be nurtured by loved ones.", "Sheldon: And turn the bedroom floor into an amniotic Slip ‘n Slide.", "Mrs Cooper (off): Shelly, come on. Your sister’s fully dilated and she wants a nice family picture before there’s blood everywhere.", "Sheldon: Oh, boy. I picked the wrong day to wear my good robot T-shirt.", "Raj: If you were having Sheldon’s baby would you really want him in the room?", "Penny: Yeah, if he’s in the room when they’re making the baby, I’ll give you ten dollars.", "Bernadette: Hey, I brought over It’s a Wonderful Life if you guys want to watch it later.", "Amy: Oh, I love that movie.", "Raj: I’ve never seen it.", "Stuart: Me neither.", "Amy: It’s great. It’s Christmastime and Jimmy Stewart’s really depressed and he’s gonna jump off a bridge and kill himself.", "Stuart: Don’t need to see it. Living it.", "Bernadette: But then he gets to see what the world would be like if he’d never been born.", "Penny: Hey, you ever imagine what that would be like? Not being born?", "Leonard: (Knock, knock, knock) What do you think? (Knock, knock, knock) What do you think? (Knock, knock, knock) What do you think?", "Amy: You make jokes about Sheldon, but if it weren’t for him, I don’t think any of us would be sitting in this room right now.", "Howard: Really? Sheldon not being here is the main reason I’m in this room.", "Amy: It’s true. None of you would know me. You wouldn’t know Bernadette. You wouldn’t be dating Penny.", "Leonard: You don’t know that. I’ve been going to the Cheesecake Factory for years. I could have picked her up. (General laughter) ", "Penny: Oh, you weren’t joking.", "Leonard: No.", "Penny: Okay, sweetie, let me tell you exactly how that would have gone down.", "Fantasy sequence in Cheesecake Factory.", "Leonard: I’m gonna do it. I’m gonna ask her out.", "Howard: I’m gonna squirt chocolate milk out of my nipples. Sorry, I thought we’re saying things that are never gonna happen.", "Raj: Maybe this time he’s going to do it.", "Howard: Hope you’re thirsty, here it comes.", "Leonard: Watch me.", "Penny: Hey, you guys ready to order or you need a few minutes?", "Leonard: I, uh, ah, um, I…", "Penny: A few minutes it is.", "Raj: You didn’t ask her out, but that was a lot of sounds.", "Leonard: You guys are making me nervous.", "Howard: Fine, then go talk to her on your own.", "Leonard: I will. Excuse me.", "Penny: Yeah?", "Leonard: Hi, uh, um, I’m Leonard?", "Penny: Really? You don’t sound so sure.", "Leonard: No, I am he. Uh, any, anyway, um, there’s been something I’ve wanted to ask you for a long time. Um.", "Penny: What’s that?", "Leonard: Eh, uh, well, I was wondering, if you’re not too busy, um, uh, if, if you’d be interested in telling me where the restroom is?", "Penny: I think you’re too late.", "End fantasy sequence", "Leonard: Come on, I would not have peed my pants.", "Howard: She nailed it.", "Raj: Sounds about right.", "Leonard: But, you forget, I did ask you out in real life.", "Amy: Which couldn’t have happened if you didn’t live across the hall from her, which couldn’t have happened without Sheldon. Same goes with you guys. If Leonard wasn’t with Penny, she never would have set you up.", "Howard: Doesn’t matter. Bernadette still would’ve been working at The Cheesecake Factory, and I still would’ve been working this beefcake factory. You would’ve been all over me.", "Bernadette: Well…", "Fantasy sequence in the Cheesecake Factory.", "Bernadette: Hey, Penny, can I take that table?", "Penny: Sure, why?", "Bernadette: The one in the turtleneck is cute.", "Raj: Open wide, here comes the happy train.", "Howard: Mm-hmm, chug-a-chug-a, yum, yum.", "Raj: Oh. Hang on. You got a, you got a little something. Ah.", "Bernadette: Never mind.", "End fantasy sequence.", "Raj: Oh, man, that is so us.", "Leonard: You know, maybe you and I wouldn’t be together, but you wouldn’t have done so great yourself.", "Penny: Why? ", "Leonard: Because I know exactly the kind of guy you would’ve ended up with.", "Fantasy sequence in Penny’s apartment.", "Zack: Hey, babe.", "Penny: Hey. Did you remember to pay the rent?", "Zack: Better. I used the money to buy these magic beans.", "End fantasy sequence.", "Penny: Hey, he may be an idiot, but at least he didn’t pee himself.", "Leonard: Oh, hold on.", "Fantasy sequence.", "Zack: Aw, babe, I peed myself.", "Penny: Me, too.", "End fantasy sequence.", "Leonard: The end.", "Amy (Tablet ringing): Hi, Sheldon. Everything okay?", "Sheldon: No, it’s not. I’ve seen things. Lady things.", "Amy: Listen to me. That is not the way they usually look.", "Sheldon: Doesn’t matter. This is no way to make new humans. People coming out of people. It’s some kind of dirty magic show.", "Mrs Cooper (off): Sheldon Lee Cooper. You get back in this room right now. And bring a mop.", "Sheldon: Did you hear that? A mop. I have two PhDs yet somehow I’m the janitor of my sister’s birth canal.", "Leonard: Hey, Sheldon sent us all an e-mail. Happy holidays from Texas. And there’s pictures. Aah! Don’t open them. Do not open them.", "Penny: Oh, come on. Childbirth is a natural, beautiful, uuurgh, it’s like someone sawed a cow in half.", "Raj: My father’s a gynaecologist, I think I can handle it. And, now, I’m gay.", "Bernadette: You know, I was thinking. Without Sheldon, most of us would have never met, but Penny would still live across from him. ", "Amy: And with Leonard out of the picture, we all know what that would mean.", "Penny: We do?", "Fantasy sequence in the Laundry Room.", "Penny: Hey, Sheldon.", "Sheldon: Hello.", "Penny: Doing laundry?", "Sheldon: Of course I’m doing laundry. Saturday night is laundry night, and I’m in a laundry room, so, I believe your inference is justified.", "Penny: Oh, my inference is justified. Sheldon, you are so funny. Anyway, I need to do my laundry, too, because these clothes are so dirty. Almost as dirty as the dirty girl who’s wearing them.", "End fantasy sequence.", "Penny: Okay, that’s enough.", "Leonard: Disagree.", "Raj: Keep going. ", "Howard: More.", "Fantasy sequence. ", "Penny: So, what do you think?", "Sheldon: A tad asymmetrical, but nothing to be concerned about.", "Penny: Please, Sheldon. I need you.", "Sheldon: To what?", "Penny: To take me.", "Sheldon: I’m not taking you anywhere till you put on a shirt.", "Penny: Come on, Sheldon. You and me right here.", "Sheldon: Penny, for the thousandth time, I’m saving myself for someone special. Perhaps a cute bespectacled neuroscientist with hair the color of mud. ", "Penny: I think I know how to change your mind.", "End fantasy sequence.", "Leonard: That’s enough.", "Raj: Ew.", "Stuart: I was okay with it.", "Amy (tablet ringing): How’s it going, Sheldon?", "Sheldon: Actually, much better.", "Leonard: Oh, good. Is the baby born yet?", "Sheldon: I don’t know. I just got back. ", "Amy: Where’d you go?", "Sheldon: My mother asked me to get some towels. I took advantage of the vague request and went to Bed, Bath & Beyond. (Scream from other room) Excuse me, I’m on the phone. So rude.", "Amy: Here’s another one. Penny, if it weren’t for Sheldon you never would have met comic book legend Stan Lee.", "Penny: Great.", "Raj: At least Leonard, Howard and I would have always been friends.", "Bernadette: Hey, how come you three never got an apartment together?", "Leonard: We talked about it, but Howard was in a pretty serious relationship with his mom.", "Howard: I lived with her to save money.", "Raj: Yeah, you didn’t have to buy groceries ’cause you were breast-feeding.", "Bernadette: Aw, so I guess if it weren’t for me, you’d still be living with her, huh?", "Howard: Not exactly.", "Penny: What do you mean, not exactly?", "Howard: Well, things would be a little different.", "Fantasy sequence in Mrs Wolowitz’s house.", "Mrs Wolowitz (off): Howard, where’s my lunch? I’m starving.", "Howard: I know you’re starving. The neighbours know you’re starving. There’s starving people in Africa who know you’re starving.", "Mrs Wolowitz (off): That’s it? There’s not enough food.", "Howard:Well, you cleaned out Earth. I don’t know what else to do.", "Bernadette: How is this any different?", "Howard: You didn’t let me finish. Here you go, Mother.", "Dead Mrs Wolowitz: You’re a good boy, Howard, such a good boy.", "End fantasy sequence.", "Amy: Wait, did she die or did you kill her?", "Howard: Eh, tomato, tomahto. The important thing is she’s dead.", "Bernadette: Hey, so how come you two didn’t move in together?", "Leonard: Oh, this guy wanted a place of his own because he was sure he was gonna be a ladies’ man.", "Raj: Yeah, I was wrong. But I do think you and I would have had a great time.", "Fantasy scene in Raj’s apartment.", "Raj: Come on, Leonard, dinner.", "Fat Leonard: Coming.", "Leonard: Hang on. Why would I be fat?", "Raj: You’d have no girlfriend to see you naked, you’d try to fill the void with food, and I’m an enabler who once deep-fried a pancake.", "Leonard: Why can’t you be fat, too?", "Fat Leonard: What do you want to do for dessert?", "Fat Raj: I think there’s still half a cake from breakfast.", "Fat Leonard: No, there’s not.", "Fat Stuart: Hey, guys.", "Fat Leonard and Raj: Stuart!", "End fantasy sequence.", "Raj: What are you doing?", "Stuart: I just wanted to be in anyone’s story.", "Raj: Yeah, but why are you fat?", "Stuart: ‘Cause Leonard was fat.", "Penny: Amy, what about you? What do you think you’d be doing if you never met Sheldon?", "Amy: It’s hard to say, my life would be so different.", "Howard: You can say better. Sheldon can’t hear you.", "Amy: I don’t know.", "Fantasy sequence in Amy’s apartment.", "Amy: Happy birthday to me, happy birthday to me, there’s tears in the frosting, happy birthday to me. (Stuart honks a party hooter at her.)", "End fantasy sequence.", "Stuart: I’ll stop now.", "Amy (tablet ringing): How’s it going, Sheldon?", "Sheldon: That’s it. The baby’s here. It’s a boy.", "Penny: Aw.", "Amy: Yay.", "Raj: Congrats.", "Sheldon: Oh, thank you. I wasn’t sure I was gonna to make it. But my mother gave me some ice chips, my sister told me to breathe, and I just thought to myself, Sheldon, if you can make it through the Green Lantern movie, you can make it through this.", "Leonard: Well, good for you, buddy. We’ll let you get back in there.", "Sheldon: Oh no, no, I’m not going back in there. That baby is so irritating. He has literally been crying his entire life.", "Howard: Aw, he’s already taking after Uncle Shelly.", "Amy: Come on, Sheldon, you should go.", "Sheldon: Why?", "Amy: Well, you always complain that you never had an intelligent role model growing up, and now you can be one for your nephew.", "Sheldon: Ugh, all right, I’ll go. But from what I’ve seen, his attention span is as limited as his bladder control.", "Bernadette: You actually got him to do it.", "Rajj: Yeah, you keep saying how much Sheldon has affected all of us, but you’ve clearly had an impact on him.", "Amy: If that were true, I wouldn’t still be living alone. Well, not exactly alone. I do have a 50 pound sack of rice with one of Sheldon’s T-shirts on it.", "Leonard: I’m telling you, Sheldon cares for you more than you think.", "Amy: I wish I could believe you. I also wish there wasn’t a mouse living in Rice Sheldon.", "Leonard: Hang on, I’m gonna give you a little early Christmas present. I’m gonna show you something, but if you ever told Sheldon he’d probably never speak to me again. So, if you want to tell him, that’s fine. Look.", "Amy: I don’t understand.", "Leonard: He made you his screensaver.", "Amy: Oh. Wow. I had no idea. He is so into me. Wait, wait, where’d I go?", "Leonard: Oh, well, it’s you, Swamp Thing, Stephen Hawking, Spider-Man, but, look, you’re in the mix.", "Amy: I am in the mix. And I’m the hottest one.", "Penny: Who’s that?", "Leonard: Oh, Madame Curie.", "Amy: That’s fine, she’s dead.", "Scene: The stairwell.", "Sheldon: You okay?", "Amy: Just really glad you’re back.", "Sheldon: Me, too. I got a lot of TV to catch up on.", "Amy: I missed you.", "Sheldon: To quote Han Solo, I know.", "Amy: Did you miss me?", "Sheldon: I would’ve preferred to have you there with me.", "Amy: Oh.", "Sheldon: Or instead of me.", "Amy: Did you hold the baby?", "Sheldon: I did. ", "Amy: And? How did it make you feel?", "Sheldon: Looking into the blank, innocent eyes of a creature that couldn’t begin to comprehend anything I was saying? Basically just another day at the office.", "Fantasy sequence at the Cheesecake Factory.", "Fat Leonard: I’m gonna do it. I’m gonna ask her out.", "Howard: And chocolate milk is gonna squirt out of my nipples.", "Fat Raj: Put up or shut up. You make it, I’ll drink it.", "Penny: You guys need anything else?", "Fat Leonard: Uh, your phone number and one more cheesecake.", "Penny: I’m sorry, I have a boyfriend. In fact, there he is now. Ready to go, sweetheart?", "Stuart: Not until I get my kiss."]}