{"series": "9", "episode": "01", "transcript": ["Following a “previously on” sequence.", "Scene: A Wedding Chapel.", "Penny: So, what package are you thinking?", "Leonard: Mm, this one comes with music and flowers. Oh, they even stream the whole thing live on the Internet.", "Penny: Why would we want that?", "Leonard: ‘Cause there’s a lot of gorgeous blondes out there who don’t believe they can land a short, nearsighted scientist. Let’s give them hope.", "Penny: Whatever. Put us on the Internet. I’ve always wanted a wedding with a comment section.", "Leonard: If you’re not into this, we can do it another time.", "Penny: No. No, I want to. Look, we’ve put this off long enough. Let’s do it.", "Leonard: Aw. That’s exactly what you said the first time we slept together. (Phone) Oh, excuse me. Sheldon. Hey.", "Sheldon: Leonard, have you gotten married yet?", "Leonard: No. Why?", "Sheldon: Good. Don’t do it.", "Leonard: Why not?", "Sheldon: Some important new information has come to light. Women are the worst. I thought it was paper cuts, but I was wrong. No piece of paper ever cut me this deep.", "Leonard: What happened now?", "Sheldon: Amy has ended our relationship.", "Leonard: Oh, no. Seriously?", "Penny: What’s going on?", "Leonard: Amy broke up with Sheldon.", "Penny: She did?", "Sheldon: Is Penny crying?", "Leonard: No.", "Sheldon: No, of course not. They thrive on our suffering.", "Leonard: Buddy, I’m so sorry. Is there anything I can do?", "Sheldon: Yes. If I ever talk about going out with a girl again, roll your eyes at me like I do to you when you say dumb things.", "Leonard: Sheldon, uh, okay, just because you’re going through this with Amy doesn’t mean that all women are bad.", "Sheldon: Whatever.", "Penny (on phone): Hey, I just heard about you and Sheldon. Are you okay?", "Amy: Not really. Can you come over?", "Penny: Uh, actually I’m in Vegas. Leonard and I are about to get married.", "Amy: Hold on. You’re getting married and you didn’t invite me?", "Penny: Well, it was kind of a spur-of-the-moment thing.", "Amy: Wow. Hope I can catch the bouquet from here.", "Penny: Amy, don’t be like that.", "Sheldon: Why did I just hear Amy’s name?", "Leonard: Penny’s on the phone with her.", "Sheldon: Did she say anything about me? Never mind. I don’t care. Well, if you care, you can find out and tell me. Just don’t be shocked when you find out that I don’t care.", "Penny: Okay, will you relax? You’re not missing anything special.", "Leonard: Hey.", "Penny: She’s upset. Look, it’s gonna be a great wedding. Look at you in your little suit.", "Sheldon: Amy’s upset? Is it about me?", "Leonard: No, I think it’s because we’re eloping.", "Sheldon: Your marriage is causing her pain? Yeah, great, I take it back. Go ahead and do it. Yay for love.", "Credits sequence. ", "Scene: Outside Amy’s apartment. ", "Sheldon: Hello.", "Amy: Oh. What are you doing here?", "Sheldon: When last we spoke, you said you needed time.", "Amy: Well, it’s only been 11 hours.", "Sheldon: The Lord of the Rings trilogy was nearly 11 hours. I made you watch that, you said it was an eternity.", "Amy: Sheldon, when I’m ready to talk, I’ll let you know.", "Sheldon: Very well. You seem to be headed somewhere. May I walk with you?", "Amy: Sure.", "Sheldon: Boy, I’m glad we’re going out again.", "Amy: We’re not back together.", "Sheldon: Why? Is there someone else? Just couldn’t wait for that first notch on your bedpost, could you?", "Amy: If you must know, I’m going to Howard and Bernadette’s to watch the wedding.", "Sheldon: And who’s this guy you’re taking?", "Amy: There’s no guy.", "Sheldon: Oh, you’re going to a wedding alone? That’s sad.", "Amy: I’m not gonna be alone. I’ll be with my friends.", "Sheldon: Your friends? Well, I think you mean my friends. And why wasn’t I invited to this?", "Amy: Maybe because the two of us being there would make them feel awkward.", "Sheldon: We make everyone feel awkward. That’s our thing.", "Scene: The Wedding Chapel. ", "Leonard: They’re running a little behind. Should be pretty soon.", "Penny: Okay.", "Leonard: Hey, if you’re hungry, there’s a breakfast buffet at the strip club next door.", "Penny: Thanks, but I don’t like glitter on my scrambled eggs.", "Leonard: I don’t think the strippers prepare the meal, but okay. Look, it’s not how I pictured it either, but I’m still glad we’re doing it.", "Penny: Me, too.", "Leonard: You sure?", "Penny: Yes.", "Leonard: And you promise you’re okay with everything from the car?", "Penny: Oh, my God, would you stop bringing it up?", "Leonard: You’re right. I’m sorry. We have the rest of our lives to dredge stuff up from the past and fight about it. So what do you think? Should we run next door and grab a bite?", "Penny: What if they call our names?", "Leonard: Oh, don’t worry. They gave me this vibrating coaster.", "Penny: Oh, and the fairy tale continues.", "Scene: Howard and Bernadette’s House.", "Amy: Thank you for doing this.", "Bernadette: Our pleasure. You feeling okay?", "Amy: We were together for so long, I honestly don’t know what I’m feeling.", "Howard: Well, that’s understandable. You forgot. It’s called happy.", "Bernadette: Howard.", "Howard: I’m not saying anything bad. Just that she was in love with her captor and somehow managed to escape from his dark and crazy dungeon.", "Stuart: I know what you’re going through. My, my, my last breakup was pretty tough.", "Amy: Oh. What was her name?", "Stuart: Hey, it’s a true story. I don’t need the third degree.", "Bernadette: For God’s sake, Sheldon, what are you doing?", "Sheldon: I didn’t want to come in. I was told it would make everyone feel uncomfortable. So I’ll just stay out here and pretend that I don’t have to go to the bathroom.", "Bernadette: Howard, do something.", "Howard: I’m on it.", "Amy: Sheldon, you being here might not be making things better.", "Sheldon: I see. And is that why everybody was invited but me?", "Amy: They didn’t invite everybody but you.Bernadette invited me, and Stuart lives here.", "Raj: Who wants hot cinnamon rolls?", "Scene: The Wedding Chapel.", "Official: So, when you hear the music, that’s your cue. Any questions?", "Leonard: Oh, the package that we paid for said the aisle was supposed to be strewn with rose petals.", "Official: Where are the rose petals?!", "Female Voice We’re out", "Leonard: You know what? It’s fine.", "Female Voice: We can use the potpourri from the bathroom!", "Penny: Really, we’re good.", "Leonard: Yup, just want to get married.", "Penny: Yeah.", "Official: Great. I’ll see you two up there.", "Leonard: This is it.", "Penny: I know.", "Leonard: I love you.", "Penny: I love you, too.", "Female Voice: Was that a yes or no on the potpourri?", "Penny: No, thank you.", "Leonard: We’re good.", "Scene: Howard and Bernadette’s House.", "Sheldon: Raj, you’re probably wondering why Amy and I aren’t showing any affection to one another.", "Raj: Didn’t even crack the top ten.", "Sheldon: Well, you should know that she recently broke up with me.", "Amy: I said I needed time to think.", "Raj: I’m sure you guys will figure something out.", "Sheldon: You hear that? Raj is devastated.", "Bernadette: Sheldon, shh. The wedding’s starting.", "Sheldon: I see what’s happening. Sides are forming. Well, if Bernadette’s on Amy’s team, I pick Howard.", "Howard: I’m not taking sides.", "Sheldon: Fine, I guess I’m stuck with Raj.", "Raj: Really?", "Stuart: At least you got picked.", "Scene: The Wedding Chapel.", "Official: Before I go any further, have either of you prepared your own vows?", "Leonard: Yes.", "Penny: No. You wrote vows?", "Leonard: Yeah.", "Penny: Well, I don’t have any. You’re kind of making me look bad.", "Leonard: It’s okay. I don’t have to say them.", "Penny: No, no, no, go ahead. I’ll come up with something mushy, you’ll cry, we got this.", "Leonard: Penny, we are made of particles that have existed since the moment the universe began. I like to think those atoms travelled 14 billion years through time and space to create us, so that we could be together and make each other whole.", "Penny: Wow.", "Official: Penny?", "Penny: Right. Um, okay. Leonard, I mean, you’re not only the love of my life. I mean, you’re my best friend, and, you’ve got a friend in me. You got troubles. I got ’em, too. There isn’t anything I wouldn’t do for you. We stick together, and we can see it through, ’cause you’ve got a friend in me.", "Official: Is that the song from Toy Story?", "Penny: He loves that movie.", "Leonard: I do.", "Scene: Howard and Bernadette’s house.", "Bernadette: Aw, that was beautiful.", "Howard: Yeah. I mean, not like our wedding beautiful.", "Bernadette: No, we totally won.", "Sheldon: Amy, I don’t understand, are we broken up or not? It’s like you can’t make up your mind.", "Amy: It’s because you’re not giving me any space to think.", "Sheldon: Well, you should think fast, because men can sire offspring their entire lives, but those eggs you’re toting around have a sell-by date.", "Amy: You know what, Sheldon, you’ve made this really easy. You’re immature, you’re selfish, you just insulted me to my face. I don’t need any more time to think. We’re broken up.", "Bernadette: Amy.", "Sheldon: Will someone take me home?", "Raj: Yeah. Come on, I’ll give you a ride.", "Official (voice from computer) …symbolizes your eternal love. I now pronounce you husband and wife.", "Penny: We did it.", "Leonard: Yeah, I’m so glad you guys could watch.", "Howard: We’ll say it was beautiful in the comment section.", "Scene: Hotel corridor.", "Leonard: No, no, no. Hang on. I believe I’m supposed to carry you across the threshold.", "Penny: Can you?", "Leonard: Who do you think carries Sheldon to bed when he falls asleep in front of the TV?", "Penny: Okay, let’s do it. You gonna make it?", "Leonard: I’m okay.", "Penny: Nicely done.", "Leonard: Thank you. Finally, there’s a Mrs. Hofstadter who isn’t disappointed in me.", "Penny: Well, the night is still young.", "Leonard: Everything all right?", "Penny: Yeah. I guess.", "Leonard: Just tell me.", "Penny: It’s just, when we were kissing, I couldn’t help but picture you with that other girl.", "Leonard: Oh, no. No, come on. I have a friend in you. You said so.", "Penny: You’re right. Just forget it.", "Leonard: Yeah. Okay, listen. If you’re imagining that it was sexy, it wasn’t. We, we were both drunk, and she smelled like an ashtray. The boat was moving a lot, so I chipped her tooth.", "Penny: Did you feel guilty?", "Leonard: No, she had dental insurance.", "Penny: Did you feel guilty after kissing her?", "Leonard: Yes. I felt guilty as soon as it happened. I feel guilty every time I see her.", "Penny: What do you mean, every time you see her?", "Leonard: What do I mean? Boy, that’s a toughie.", "Penny: You still see her?", "Leonard: Well, no, not socially. But, you know, just at work.", "Penny: You work with her? How could you not tell me that?", "Leonard: I wanted to tell you in the car, but you told me to stop talking", "Penny: Oh, okay. So you’re saying this is my fault?", "Leonard: No, of course not. Okay, look, instead of fighting, why don’t we dim the lights, um, get naked and make a baby? I was trying to lighten the mood. It’s not easy. You try it.", "Scene: The apartment.", "Sheldon (on phone): Hello, Mother.", "Mrs Cooper: Shelly! How’s my baby doing?", "Sheldon: I just wanted to let you know that you can remove Amy from your nightly prayers. Unless you’re open to praying for a beehive to fall on her head.", "Mrs Cooper: Oh, what’s going on?", "Sheldon: She broke up with me.", "Mrs Cooper: Oh, Shelly.", "Sheldon: No, I’ll be okay. But I think that I’d like to send the ring back to you.", "Mrs Cooper: Well, let’s not be hasty. Are you sure it’s over for good?", "Sheldon: It’s over for me. I’m done with women. Like when I swore off Pop Rocks. They both hurt you on purpose.", "Mrs Cooper: You want to tell me what happened?", "Sheldon: Are you going to say it’s all part of God’s plan?", "Mrs Cooper: Good chance.", "Sheldon: Then no, thank you.", "Mrs Cooper: Well, honey, don’t send it back yet. Your sister’s married, and I’m not letting your brother give my grandmother’s ring to that whore he’s dating.", "Sheldon: Wasn’t Mary Magdalene a woman of ill repute?", "Mrs Cooper: When your idiot brother redeems mankind, he can date whoever he wants.", "Scene: Howard and Bernadette’s house.", "Bernadette: I know it hurts now, but it’s gonna get better.", "Amy: Yeah.", "Howard: Everything’s gonna be okay.", "Stuart: You’ve got so much to offer.", "Amy: Thank you.", "Stuart: Any man would be lucky to have you.", "Bernadette: That’s true.", "Amy: I just hope I did the right thing.", "Stuart: I’m sure you did. Maybe that’s the problem, you always do the right thing. Maybe it’s time to do the wrong thing.", "Amy: Like you’re doing right now?", "Stuart: Exactly.", "Scene: The stairwell. ", "Leonard: I asked you over and over if you were okay. Why would you go through with the wedding if you weren’t?", "Penny: I thought I was okay, but it turns out I’m not.", "Leonard: Okay, listen, I may not have been entirely faithful, but you, you are not easy to lift.", "Sheldon: Wow. Well, marriage must agree with you. Well, you are just glowing.", "Leonard: I’m not glowing. I’m upset.", "Sheldon: Well, whatever it is, it agrees with you.", "Scene: Penny’s apartment.", "Sheldon (outside): Knock, knock, knock, Penny? Knock, knock, knock, Penny? Knock, knock, knock, Penny?", "Penny: What’s this?", "Sheldon: Leonard told me what happened, so I took it upon myself to make you a hot beverage.", "Penny: Oh. That’s so sweet of you.", "Sheldon: Yeah. I know. Turns out, being sweet isn’t enough to keep a girl these days. I blame Madonna.", "Penny: I’m sorry to hear about you and Amy.", "Sheldon: Well, I’m sorry about Leonard. Thought I raised him better than that.", "Penny: You know, it’s bad enough what happened, but then he tried to hide the fact that he sees her all the time at the university.", "Sheldon: He does? Who is it?", "Penny: Some girl named Mandy.", "Sheldon: Mandy Chao?", "Penny: Yeah.", "Sheldon: Oh, you don’t need to worry about her. She’s brilliant and attractive. She can do way better", "than Leonard.", "Penny: That’s great.", "Sheldon: Wait a minute. I know this may sound far fetched, but I’m on the market now. You know, if I dated Mandy, that would teach both Leonard and Amy a lesson.", "Penny: That’s ridiculous.", "Sheldon: Oh, you’re right. I could never be with a woman whose self-esteem was so low she’d be with Leonard.", "Penny: I’m with Leonard.", "Sheldon: Yeah, I know. Forever. Who would have believed these things would happen to us?", "Penny: Right? I can’t believe Amy actually went through with it.", "Sheldon: Hang on. You knew that she was going to end it with me? Did you try and stop her?", "Penny: I told her to be true to herself and do what makes her happy.", "Sheldon: Do what makes her happy? She plays the harp and her car is paid for. How much happier can she be?", "Penny: Okay, look, it’s not my fault that she thought you were a bad boyfriend.", "Sheldon: I see. Well, I think I’ll be going.", "Penny: Sheldon.", "Sheldon: No, no, no, no. We are done here. Would you mind opening the door and then angrily slamming it behind me?", "Penny: Sure.", "Sheldon: Thank you. And slam it hard, because I am pretty steamed.", "Scene: Howard and Bernadette’s house.", "Howard (on phone): All right, Leonard, hang in there. Talk to you tomorrow.", "Bernadette: What happened? They just got married.", "Howard: I don’t know. It’s a mess. They had a huge fight in Vegas.", "Bernadette: Think they’ll break up?", "Howard: I don’t know. Sounds pretty bad. Penny’s back in her apartment all by herself.", "Stuart: Really?", "Scene: The apartment.", "Sheldon: Would you like to hear another reason why men are better than women?", "Leonard: Sure, let’s make it an even hundred.", "Sheldon: You would never kiss me and make me say I love you and then break up with me.", "Leonard: I wouldn’t.", "Sheldon: And you know why? ‘Cause you’re a man. The champagne of genders.", "Leonard: Well, I may be a man, but I think I’m the one that screwed up on this one.", "Sheldon: Yeah, well, and you admit it, like a man. All you hear women say is, I’ll just have a salad. You know? Where’s my lip gloss? I think this element should be called radium. That last one was Madame Curie.", "Leonard: I figured that out.", "Sheldon: You know what? She was kind of an honorary man. She had a penis made of science.", "Leonard: Can’t believe I’m spending my wedding night with you.", "Sheldon: Really? I never imagined it any other way.", " "]}