{"series": "6", "episode": "12", "transcript": ["Scene: The apartment.", "Sheldon: Well, I must say, Leonard, when I first heard your idea for Giant Jenga, I was sceptical.", "Leonard: I can’t blame you. Tiny Twister was a complete bust.", "Sheldon: No, I was wrong. The looming threat of being crushed under a pile of lumber does add a certain spice. I’ve never felt so alive. (Answers door) Oh, hello, Alex. Uh, let me go get you last night’s recordings.", "Leonard: What recordings?", "Sheldon: Well, you remember when you told me I talk in my sleep? Well, it occurred to me that, like most things I say, it’s probably pure gold. So I started recording it all, and now Alex gets to comb through eight hours of what I like to call Sheldon After Dark.", "Alex: Hey, Leonard.", "Leonard: Hey. Just playing a little Giant Jenga here.", "Alex: Oh, I know, I’m the one who had to buy him the helmet. So, do you have any plans this weekend?", "Leonard: Well, most of Saturday’s gonna be figuring out where to put this game when we’re done. How about you?", "Alex: Oh, I’m gonna go see Kip Thorne give a lecture on subatomic space-time.", "Leonard: Ooh. That’s his take on John Wheeler’s quantum foam. That should be great.", "Alex: Well, if you want, you can come with me.", "Leonard: Ah, I’d love to, but I’m supposed to hang out with Penny.", "Alex: Well, bring her.", "Leonard: Well, she’s not really into that kind of stuff.", "Alex: Yeah, okay. Well, if you want to hear about the lecture, I can tell you all about it at work, or, you know, over dinner sometime.", "Leonard (jumping and knocking over the Jenga): What?", "Sheldon: Jenga, I win!", "Credits sequence.", "Scene: The cafeteria.", "Howard: Oh, come on, that can’t be true.", "Raj: I did the research. Tony the Tiger, Dig’em the Frog, Cap’n Crunch, Toucan Sam, Count Chocula, Trix the Rabbit, Snap, Crackle and Pop. Not one cereal mascot is a girl. It’s a total breakfast sausage fest.", "Leonard: Are we done with this?", "Raj: Almost. Franken Berry, Boo Berry, Sugar Bear and the Honey Nut Cheerio bee, I believe his name is Buzz.", "Leonard: Terrific. Something weird happened and I don’t know what to do about it.", "Howard: What’s going on?", "Leonard: Sheldon’s assistant asked me on a date last night.", "Raj: How could you do that to me? You know I’ve been working it with Alex for weeks.", "Leonard: Working it? You can’t even talk to her.", "Raj: I talk with my eyes.", "Howard: You look like my little cousin when he’s dropping one in his diaper.", "Leonard: She knows I have a girlfriend. It’s so weird.", "Raj: Oh, my God. You’re loving this.", "Leonard: To my bones. I mean, I’m not gonna do anything about it. I love Penny. It’s just nice to have a young, attractive woman sniffing around the goods.", "Raj: I both hate you and want to be you. This is Ryan Gosling all over again.", "Sheldon: Ah, gentlemen, what is on the conversational menu this morning?", "Raj: Leonard stole my woman, and he knew full well I was only six to eight months away from making my move.", "Leonard: I didn’t steal anyone.", "Raj: Your assistant is totally hitting on this jerk and he loves it.", "Sheldon: Well, that’s not acceptable. I mean, I’m her boss. She needs to be solely focused on my needs, not distracted by your pasty, androgynous brand of sexuality.", "Leonard: I’m androgynous?", "Sheldon: Oh, please. Look at you with your pouty bee-stung lips.", "Leonard: What do you guys think I should do?", "Raj: I say you tell Alex your heart belongs to Penny, I provide her a shoulder to cry on, and then roughly half a year later I give it to her good.", "Scene: Amy’s apartment.", "Sheldon: I want to thank you all for coming on such short notice. Uh, in the past, I’ve reached out to each of you individually, but I believe my present situation requires the collective wisdom of the group, which as you can see from your commemorative T-shirts I have dubbed Sheldon Cooper’s Council of Ladies.", "Penny: What is happening?", "Sheldon: I need your advice about a delicate workplace situation. Uh, to protect those involved, I’ll be changing their names.", "Bernadette: Who’s involved?", "Sheldon: Well, a short, bespectacled colleague of mine who lives in the shadow of his brilliant roommate. Let’s call this colleague Ricardo Shilly-Shally.", "Penny: You’re talking about Leonard.", "Sheldon: No, no, Shilly-Shally has red hair and, uh, he briefly served in the Mexican Navy. Anyway, despite the fact that he has a girlfriend, Shilly-Shally has been the recipient of inappropriate workplace flirtations from a young lady.", "Amy: It’s your assistant Alex, isn’t it?", "Sheldon: No. No. No. This is Tondelaya della Ventimiglia.", "Penny: Wait, what the hell’s going on with Leonard and Alex?", "Sheldon: No, uh, no, I’m sorry. Who’s talking about Leonard and Alex?", "Penny: Fine. Ricardo and Tondelaya.", "Sheldon: Okay, look, it’s not really about Ricardo and Tondelaya. It is really about her boss, who doesn’t quite know how to handle this situation and could use your advice, which is surprising because Dr. Einstein Von Brainstorm, he’s usually pretty smart about these things.", "Penny: I’m gonna kill her.", "Bernadette: I’m sure you’ve got nothing to worry about. Leonard would never cheat on you.", "Amy: She’s right. But say the word, I got a lab full of cocaine-addicted monkeys with nothing to lose. One of them could end up in the backseat of her car. Or her shower.", "Sheldon: Ladies, ladies, please. We’re not here to talk about Penny, okay? We’re here to talk about me. Uh, I mean Einstein Von Brainstorm. Oh, darn it! All right, I guess the cat’s out of the bag. Let me explain what’s going on. Ricardo is really Leonard.", "Penny: We know what’s going on, Sheldon!", "Sheldon: Well, what should I do?", "Bernadette: Well, Alex is your employee. If she’s doing something that’s making Leonard uncomfortable, you should talk to her.", "Sheldon: Oh, no, he’s not uncomfortable at all. No, he’s loving it. Yeah, he’s strutting around like he’s five-foot-six.", "Penny: What? He’s loving it?", "Bernadette: Sheldon, you need to talk to Alex right away.", "Sheldon: Talk to her? That’s all you’ve got? With a cool name like Sheldon Cooper’s Council of Ladies, I really expected more. Give me back the T-shirts.", "Scene: Sheldon’s office.", "Sheldon: Alex, check my schedule. What does my afternoon look like?", "Alex: I think it’s pretty wide open. Oh, wait. Here’s something at four o’clock. Give Alex a talking to?", "Sheldon: Well, that snuck up on us, didn’t it?", "Alex: Is there a problem?", "Sheldon: Let’s not call it a problem. Let’s call it an opportunity. To solve a serious problem.", "Alex: What did I do?", "Sheldon: You don’t know? Oh, you poor dear. Your ovaries are squirting so much goofy juice into your brains you don’t even know which way is up. You made an inappropriate sexual advance towards Dr. Hofstadter.", "Alex: What? I didn’t make a sexual advance on anybody.", "Sheldon: Now, there’s no need to get defensive. I’m not unsympathetic to your plight. My father used to say that a woman is like an egg salad sandwich on a warm Texas day.", "Alex: What?", "Sheldon: Full of eggs and only appealing for a short time.", "Alex: This conversation is making me uncomfortable.", "Sheldon: Yeah, you and me both, sister. Now, please understand, I don’t hold you responsible for your behaviour because, see, from an evolutionary standpoint, you’re a slave to your desire to reproduce. But during the work day, when you feel possessed by amorous intent, may I suggest that you suppress it by leafing through this illustrated book of sexually transmitted diseases? Let’s see here. Oh, yes. Check out this oozy doozy.", "Alex: I have to go.", "Sheldon: So does this fellow, but he can’t without it burning like hot soup.", "Scene: The stairwell.", "Leonard: Hey, pretty lady.", "Penny: Oh, you seem extra happy.", "Leonard: Uh, I guess I am.", "Penny: Any particular reason why?", "Leonard: I don’t know, just having a good day. This morning Sheldon fell asleep on the way to work, so I got to listen to the radio. That was pretty crazy.", "Penny: Mm-hmm. Anything else?", "Leonard: Mm. I found this quiz online called Which Star Trek Character Are You? and it only took me four tries to get Captain Kirk.", "Penny: That’s great.", "Leonard: Oh. It. Was.", "Penny: Hmm. Well, I’m glad you’re having such a great day.", "Leonard: Yeah. And the one thing that could make it even better is an evening with my special girl.", "Penny: Oh, and who’s that?", "Leonard: What do you mean?", "Penny: Oh, I just didn’t know if you meant me or Alex.", "Leonard: Um, why would I mean Alex?", "Penny: Because I know she hit on you and I know you liked it.", "Leonard: What?", "Penny: Don’t play dumb with me, Ricardo Shilly-Shally!", "Leonard: I’m missing something. (Enters apartment. To Sheldon) Did you say something to Penny about Alex?", "Sheldon: Oh, yes. Yeah, and a fat lot of good it did me. All she did was get mad at you.", "Leonard: Why would you do that?", "Sheldon: I needed advice about a woman. I would have asked you, but if the last few years have proven anything, it’s that you can’t tell a uterus from a unicycle.", "Leonard: At least I know not to blab to a girl about somebody flirting with her boyfriend.", "Sheldon: Good to know. Yeah, a few more helpful hints like that, you may find yourself on the Council of Ladies. (Answering phone) Hello. I see. Uh, what time? Very well, then. Huh. That was the Human Resources Department at the university. Apparently, my assistant Alex has filed a complaint accusing me of inappropriate behaviour in the workplace.", "Leonard: Oh, my God, what did you do?", "Sheldon: Hmm, let me think. Nothing. I’m a delight.", "Scene: The Human Resources Department.", "Sheldon: (Knock, knock, knock) Human Resources Department. (Knock, knock, knock) Human Resources Department. (Knock, knock, knock) Human Resources Department.", "HR Woman: Come in.", "Sheldon: Hello.", "HR Woman: Ah, Dr. Cooper, have a seat.", "Sheldon: Thank you.", "HR Woman: I called you in today because your assistant Alex Jensen has lodged a complaint against you.", "Sheldon: So I’ve been told. But I can’t understand what she has to complain about. I mean, she has a front-row seat as I make scientific history. There’s string cheese in my mini-fridge, and that’s for anyone. Yeah, and just yesterday I led her away from a life of sexual promiscuity by making her look at pictures of disease-ridden genitalia.", "HR Woman: Cancel my next appointment. This is gonna take a while. Dr. Cooper, you said things to your employee that you just cannot say in the workplace.", "Sheldon: Like what?", "HR Woman: Well, according to Ms. Jensen, you said that she was a slave to her biological urges and called her an egg salad sandwich. I don’t even know what that means, but I’m gonna go ahead and tell you you can’t say it.", "Sheldon: Oh! I see the confusion here. No, no, Alex thought I was singling her out. No. I meant that all women are slaves to their biological urges, you know? Even you. You’re a slave.", "HR Woman: I’m a what?", "Sheldon: Well, y-you, I-I’m just saying, you know, at a certain point in a woman’s menstrual cycle…", "HR Woman: Whuh-ah! Woah! You can’t talk about that, either, Dr. Cooper. Your language is entirely inappropriate, and I’m gonna advise that you shut your mouth right now.", "Sheldon: I don’t see why I’m the one being persecuted here. Dr. Hofstadter, he was bragging about his sexual desirability to anyone who would listen. You know, and Howard Wolowitz, he spent two years using university resources building a six-breasted sex robot. Oh, and at the office Christmas party, I heard Rajesh Koothrappali refer to you several times as Brown Sugar.", "HR Woman (writing): Hofstadter… Wolowitz… and the last one was Rajesh Koothrappali?", "Sheldon: Yes. No, yeah, but in his defense, that wasn’t racist. He’s also brown.", "Scene: Penny’s apartment. Penny answers the door. Leonard is playing his cello outside.", "Leonard (singing): I’m sorry Alex hit on me, hit on me, hit on me. I’m sorry Alex hit on me, I’d no idea I’m cute.", "Penny: Oh, damn it, you are.", "Leonard: Please forgive me. I should have told you about Alex.", "Penny: I don’t care about Alex. Fine, I care. Okay, I hate that bitch. But what really hurt is that you liked it so much. I mean, do I need to be worried?", "Leonard: Of course not. No. Why?", "Penny: Because, she is pretty and smart, and when you talk about work, she doesn’t have to go home and look up words in the dictionary to understand what you said.", "Leonard: You do that?", "Penny: No.", "Leonard: Hang on. Are you feeling insecure? Because that’s my thing, and if you take it away, I don’t know what I’m bringing to this relationship.", "Penny: Yes, Leonard, I am insecure. Happy?", "Leonard: No, I’m not happy.", "Penny: Why are you smiling?", "Leonard: I’m sorry. I just never think of you having feelings like that.", "Penny: Well, I do.", "Leonard: Why? Nothing is ever going to happen between me and Alex.", "Penny: Good.", "Leonard: Come here. Tell you a secret?", "Penny: What’s that?", "Leonard: With all these women chasing me, I kind of do feel like Captain Kirk.", "Penny: Can I tell you a secret?", "Leonard: Sure.", "Penny: Keep talking about Captain Kirk, and we’re all gonna stop.", "Leonard: Message received. Ah, excuse me. (Answering phone) Hello. This is Dr. Hofstadter. Okay. All right, thank you. That’s weird. I’m getting called in to Human Resources.", "Penny: What did you do?", "Leonard: I don’t know.", "Scene: Howard and Bernadette’s kitchen.", "Howard: Huh. I just got called in to Human Resources.", "Bernadette: Why?", "Howard: I don’t know.", "Scene: Raj’s apartment.", "Raj: Huh. That is so strange. Human Resources wants to talk to me tomorrow. (To his dog) Could you stop licking your ass for two minutes? I have a problem here.", "Scene: Human Resources department.", "Howard: Do you really think you should be drinking right now?", "Raj: How else am I supposed to talk to the Human Resources lady?", "Howard: I don’t know. Seek professional help?", "Raj: I did. The guy at the liquor store said this stuff tastes great in coffee.", "Howard: Wait, you got called in, too? What is going on?", "Leonard: Sheldon threw us all under the bus.", "Howard: Oh.", "Raj: I feel like I’ve been called down to the principal’s office. Although I wouldn’t mind if Brown Sugar suspended me. From a sex swing. This may have been a mistake.", "Howard: Relax. Everything’s gonna be fine. Before I met Bernadette I was in here every other day. Uh, little tip, turn off your I Like Big Butts ringtone before you go in.", "Raj: Well, this is all your fault.", "Leonard: How is this my fault?", "Raj: If you weren’t screwing around with Sheldon’s assistant, none of this would be happening.", "Leonard: I wasn’t screwing around with anyone.", "Raj: Oh, of course not. She was just sniffing around your goods because she was hunting for truffles.", "HR Woman: Ah, Mr. Wolowitz, it’s been a while.", "Howard: Hey, Janine. How are Tom and the kids?", "Janine: Fine. You must be Dr. Hofstadter.", "Leonard: Yes, but I think this is all a big misunderstanding.", "Raj: Yeah, yeah, me, too. I didn’t do anything.", "Janine: Is that alcohol on your breath?", "Raj: Howard built a sex robot.", "Howard: That is not true. All I did was build a robot.", "Janine: Did it have six breasts?", "Howard: I’m sorry, I’m a feminist, I don’t notice things like how many breasts a robot has.", "Sheldon: Well, hello.", "Leonard: What are you doing here?", "Sheldon: Actually, I came to speak to Mrs. Davis.", "Janine: And I’m a little busy right now.", "Sheldon: But I came to file a complaint. Somebody has made me feel uncomfortable in the workplace by using language of an inappropriate and sexual nature.", "Janine: And who was that?", "Sheldon: You, you dirty birdie. I-I thought about the things you said to me yesterday, and I realized I’m deeply offended. Now, be a dear and get me one of those complaint forms.", "Janine: That’s it. All of you, in my office now!", "Sheldon: And thanks to you, I know better than to ask if you’re menstruating. And based on your behaviour, I don’t have to.", "Scene: Sheldon’s office.", "Sheldon: It has been pointed out to me that some of the things I said to you could be construed as offensive, and I would like to offer you my sincerest apology.", "Alex: Thank you, Dr. Cooper.", "Sheldon: Yeah, additionally, you should know that the university has mandated that I take an online sexual harassment seminar so this sort of thing doesn’t happen in the future.", "Alex: Okay.", "Sheldon: Yeah. Now, unfortunately, uh, my time is much too valuable to waste on nonsense like this, so, um, I’m gonna need you to take it for me. Oh, and, uh, you’d better ace it, they’re pretty mad.", "Scene: The apartment.", "Penny: So, hey, I was thinking about that stuff with Alex.", "Leonard: Oh, would you stop worrying about that?", "Penny: I can’t help it. But, look, I figured I could sit around and feel insecure, or I could do something about it. So I got a course catalogue at school and looked at some of the science classes.", "Leonard: That’s great.", "Penny: No, it isn’t, they are extremely boring. I mean, how do you not kill yourself, like, every day? Anyway, I decided I don’t need to be a scientist, I could just look like one. So I bought these.", "Leonard: Glasses? I really don’t think that’s gonna change… oh, my God, you look so smart and hot.", "Penny: I know, right? Watch this. Molecules.", "Leonard: Okay, come with me.", "Penny: Where are we going?", "Leonard: To my bedroom, so I can take everything off but those glasses. And maybe the boots."]}