{"series": "10", "episode": "14", "transcript": ["Scene: The stairwell.", "Leonard: What’s going on with that woman you’re dating?", "Raj: I broke up with her.", "Leonard: Why?", "Raj: She said she didn’t want to see me any more and I found that insulting.", "Howard: I thought things were going well. What happened?", "Raj: I don’t know, she didn’t even give me a reason.", "Sheldon: That’s not a problem, we can figure this out. What are the reasons women reject Raj?", "Raj: Can we not play this game?", "Sheldon: Doesn’t like games. That’s one.", "Leonard: Ignore him. Yeah, sorry about the breakup.", "Raj: That’s okay, I’m fine.", "Sheldon: Of course you’re fine. Not every member of a species finds a mate. Sir Isaac Newton died a virgin, look at the contributions he made.", "Raj: I’m not a virgin, Sheldon.", "Sheldon: So now you think you’re better than Isaac Newton? Oh, no wonder women don’t like you.", "Leonard: You’re not being very nice.", "Sheldon: What? He said he was fine.", "Howard: Sometimes people say things they don’t mean.", "Sheldon: Oh, that’s a paradox. I mean if you meant what you just said, then that means you may not have meant what you just said.", "Leonard: Careful, I saw this on Star Trek. Smoke’s gonna come out of his ears soon. Hey.", "Penny: Hey, boys. How’s it going?", "Sheldon: Well, I thought we were having a nice conversation, but it turns out I was being offensive.", "Bernadette: So, normal.", "Sheldon: Yeah.", "Amy: Sheldon, what did you do?", "Sheldon: We were discussing Raj’s recent breakup and apparently, I was insensitive to him.", "Raj: It’s okay, I’m fine.", "Sheldon: Don’t fall for it. He’ll get you to compare him to a dead virgin, and suddenly you’re the bad guy.", "Raj: Sheldon, when I said I was fine, I meant I didn’t want to talk about it any more.", "Sheldon: Then why didn’t you say that?", "Howard: Because that’s not what people do.", "Sheldon: Well, I would prefer if people told me exactly what is on their mind.", "Penny: No. No, you don’t, you really don’t. I actually can’t say don’t enough.", "Sheldon: Well, it certainly would be easier. You have no idea what it’s like to struggle with recognizing emotional cues.", "Amy: I’m sure it’s extremely frustrating.", "Sheldon: Thank you.", "Amy: And also a little sad.", "Sheldon: Okay, now you’re just showing off.", "Bernadette: You know, I just read that a team at MIT. developed a device that helps people read human emotions.", "Leonard: And you think we can get those guys to reprogram Sheldon? Cool.", "Bernadette: It’s supposed to be accurate, like, 85% of the time.", "Penny: Wow, I find that hard to believe.", "Leonard: That a bunch of awkward scientists with no social skills would invent a machine to do it for them?", "Penny: I take it back. I believe it.", "Howard: You if it’s at MIT, I can make some calls. Maybe we can get Sheldon a prototype.", "Amy: What do you think?", "Sheldon: A machine that reads emotions is intriguing. It could help me be a more considerate friend.", "Bernadette: Wouldn’t that be nice.", "Sheldon: It could also help me identify my enemies, discover their fears and then I could use those fears to destroy them.", "Bernadette: I like the first one.", "Credits sequence.", "Scene: The comic book store. ", "Raj: Now that Sheldon’s across the hall, have you decided what you’re doing with his old room?", "Leonard: I was thinking maybe a library or a gaming room.", "Sheldon: You could make it a train room.", "Leonard: I don’t like trains. You like trains.", "Sheldon: I know, and Amy says I can’t have a train room.", "Howard: Sheldon, I just heard from the guys at MIT about that emotion reader. They’re sending a prototype for you to beta test.", "Sheldon: Wonderful. Although I’m not sure how I feel about being used as a guinea pig.", "Leonard: Well, when you get the machine, you can find out.", "Raj: Maybe I could use it to understand why women keep dumping me.", "Howard: Well, you don’t need a machine for that, just send a survey card to all your ex-girlfriends and tell them if they fill it out they might win a prize.", "Raj: That’s actually not a bad idea. Maybe I could even get them all together, sort of like a, a focus group, to find out what’s wrong with me.", "Leonard: No, Raj, that’s a terrible idea.", "Howard: Yeah, I was joking.", "Sheldon: Really? Uh, little tip: jokes are often better when you end them with wocka wocka or ha-cha-cha.", "Scene: The apartment. ", "Leonard: Hey, great news. The TV I want will fit in the gaming room, and if I leave the curtains open, I can watch it from work.", "Penny: Hey, can you hold off redoing the room? My brother’s coming out here in a few weeks.", "Leonard: Oh. Yeah. Okay, sure. What’s going on with your brother?", "Penny: My dad asked if I can get him a job interview at my work.", "Leonard: Huh. Is that a good idea? I mean, you think they’ll consider someone who was in prison for selling drugs?", "Penny: Well, I sell pharmaceuticals. That’s just a really hard to spell word for drugs.", "Leonard: Well, I’m sure he’ll appreciate carrying his samples in a briefcase instead of his colon. How long do you think he’ll stay?", "Penny: I, I’m not sure. Maybe a few days. Unless he gets the job, then who knows?", "Leonard: Hmm. Who knows? That’s exciting. I’ll get to wake up every morning and see if he’s still here.", "Penny: You don’t have a problem with this, do you?", "Leonard: Of course not. I mean, he’s your brother.", "Penny: Okay. Thank you, you’re the best. Mm.", "Leonard: Remember that when the new TV falls off the wall and crushes us both.", "Scene: Sheldon’s office.", "Howard: This thing’s pretty cool. It interprets emotions using a wireless signal to analyse subtle changes in breathing and heart rate.", "Amy: It’s amazing a machine can do that.", "Sheldon: Yes. Now, when the robots rise up, they’ll know that I’ve been rooting for them the whole time.", "Howard: The display is synced to your phone. Give it a try.", "Amy: All right. Now, I’m gonna look at some pictures to prompt an emotional response, and we’ll see if the machine can identify them accurately.", "Howard: Okay, remember, it can only detect happy, sad, angry and excited. Not other things you’re feeling, like, what have I done with my life?", "Amy: Okay, I’m looking at the first picture.", "Sheldon: You are happy?", "Amy: Yes. I’m looking at puppi", "Sheldon: Aw. Somebody’s ignoring their tiny needle teeth, but all right. ", "Howard: Try another one.", "Amy: Okay. What does it say I’m feeling?", "Sheldon: Sad.", "Amy: Yes. I’m looking at a picture of my grandma.", "Sheldon: Oh, that makes sense, ’cause she’s gone and you miss her.", "Amy: Yes.", "Sheldon: And you’re worried that turkey neck is in your future. What, now, see, now it says you’re mad. Make up your mind.", "Scene: Howard and Bernadette’s kitchen. ", "Raj (on phone): Okay, Emily. Yeah, sounds great. See you then.", "Bernadette: Is that Emily your ex-girlfriend?", "Raj: Yeah. I’m getting all my exes together in order to discuss why they broke up with me and how I can be a better boyfriend.", "Howard: Oh, God. You went through with that? What is wrong with you?", "Raj: We are going to find out.", "Bernadette: Why would you do that, Raj?", "Raj: Well, I want information in order to improve myself.", "Bernadette: You’re not gonna get information, you’re just gonna get criticism that hurts your feelings.", "Raj: Don’t worry, I’m a grown man. I have a thick skin.", "Howard: You’re so stupid.", "Raj: Hey. ", "Scene: The apartment. ", "Penny: Hey, would you take a look at my brother’s résumé? I’m trying to help him clean it up a little.", "Leonard: Yeah, sure. He really worked with the Drug Enforcement Agency?", "Penny: He didn’t know it till he was cuffed, but yeah.", "Sheldon: Hey, Leonard, if you’re happy and you know it, no need to clap your hands, because I have an emotion detector.", "Leonard: How’s it working out?", "Sheldon: Surprisingly well.", "Leonard: That’s great, I’m happy for you.", "Sheldon: No, wait, uh, hold on. Oh, what, you are. Aren’t you sweet?", "Amy: What’s that? Are you working on your resume?", "Penny: No, it’s my brother’s. I’m trying to help him get a job out here.", "Sheldon: Oh, ooh! And that makes Leonard angry.", "Leonard: No, it doesn’t.", "Sheldon: What, Leonard, please. I know an angry face when I see it. It’s this red frowny guy on my phone.", "Penny: What? Are you really upset about Randall coming?", "Leonard: No.", "Sheldon: Yes.", "Leonard: I said no.", "Sheldon: It’s like you’re twins.", "Penny: Leonard, if you’re mad about this, just tell me.", "Leonard: Fine. You invited your drug dealer brother to stay with us for God knows how long and didn’t bother to ask me first.", "Penny: He’s my brother. I didn’t think I needed your permission.", "Sheldon: Well, hey. Now she’s angry, too. This thing works like gangbusters.", "Leonard: I’m not saying you have to ask my permission, but you could have talked to me about it before you said it was okay.", "Penny: Like you talked to me about your gaming room?", "Leonard: Our gaming room. I was gonna put a scented candle in it.", "Sheldon: He’s still mad.", "Amy: Stop enjoying their fight.", "Sheldon: You first.", "Penny: If you were this upset, why didn’t you say so when I told you?", "Leonard: Because I didn’t want to sound like a jerk.", "Penny: Well, you sound like one now. I don’t see the big deal if my brother comes and stays for a while.", "Leonard: If you get him a job, he’s gonna live here forever!", "Penny: He would get his own place.", "Leonard: Has he ever had his own place?", "Penny: Yes.", "Leonard: Did it have a metal toilet next to the bed?", "Penny: It still counts. You know, how is this any different from you making me live with Sheldon?", "Sheldon: Hey, I shared my Honey Nut Cheerios with you.", "Penny: You gave me a bill at the end of every month. ", "Leonard: Stay out of this. You and your stupid machine started this fight.", "Sheldon: You are lucky that this feelings machine doesn’t have feelings.", "Amy: Come on, Sheldon, let’s go.", "Sheldon: Gladly. Can we storm out?", "Amy: I think it loses its impact if we’re chatting about it.", "Sheldon: Fine. I’ll just give them the finger.", "Scene: Raj’s apartment. ", "Raj: Okay, first off, I want to thank you all so much for coming. Howard is here to interpret for Emily, and to take notes. ", "Howard: No, he doesn’t think it’s stupid.", "Raj: Uh, heads up, both of you are named Emily, so we’ll call you red-headed Emily, and you, red-headed Emily, Junior.", "Howard: Hey, you went out with him. I didn’t.", "Raj: Okay, uh, let’s get things started. Um, why don’t we go around the room, say your name, and why you broke up with me. Want to kick it off?", "Lucy: Oh, okay. Um, I’m Lucy, and I broke up with Raj because I have severe social anxiety, and he kept trying to force me into uncomfortable situations.", "Howard: Like this one?", "Lucy: Yeah.", "Raj: I did do that. I can be insensitive to other people’s boundaries. Howard, would you write that down?", "Howard: Schmuck. Got it.", "Raj: Uh, next?", "Claire: Okay. Um, I’m Claire. And I guess I broke up with you because you were just really needy. Also, you were incredibly vain, like, all the time you spent shaping your eyebrows.", "Raj: Okay, new rule, everybody only gets one. Uh, next?", "Emily: Ooh, I’m not sure I’m comfortable sharing details about our relationship in front of Howard.", "Raj: Oh. He’s here to support me, so anything you have to say you can say in front of him.", "Emily: Okay. Well, whenever you and I were in bed…", "Raj: Howard, get out.", "Howard: Not a chance. So, you were telling us how Raj was terrible in bed.", "Scene: Sheldon and Amy’s apartment. ", "Amy: Sheldon, dinner’s ready. I made beef loaf, because I know you’re uncomfortable with the non-specificity of meat loaf. Sheldon? Hey, are you okay?", "Sheldon: Not really.", "Amy: What’s going on?", "Sheldon: I wish I never tried that device. And I know I said the same thing after the massage chair, but this time I mean it.", "Amy: I’m sorry Leonard and Penny hurt your feelings.", "Sheldon: It’s more than that. It’s me. I always knew I had trouble recognizing other people’s emotions, but that machine just made it so real.", "Amy: Well, everybody has things that they need help with. Like me, I can’t see without my glasses. And right now you’re just a, a cute, pink smudge wearing a childish green smudge.", "Sheldon: I thought I was getting better at it, but clearly I’m not.", "Amy: Yes, you are. There have definitely been days when I was sad and you could tell.", "Sheldon: Yeah, but that’s shooting fish in a barrel. You’re kind of a sad sack. I’m sorry, I shouldn’t have said that. I’m just upset.", "Amy: No, see, right there, you knew you hurt my feelings. And I’m proud of you, for reasons I’m sure have something to do with my father. And if you don’t like that machine, get rid of it. Because I love you exactly the way you are.", "Sheldon: I feel the same way about you. Now, put your glasses back on. You look weird.", "Scene: Raj’s apartment.", "Howard (translating for other Emily): I thought you were great, but, oh, my God, you were so dominated by your parents.", "Emily: Oh, yeah, that used to drive me nuts. He’s kind of a mama’s boy.", "Claire: Kind of?", "Raj: Okay, that’s enough. Write down loving son.", "Lucy: Can I just say something? Going out with Raj was one of the best things that ever happened to me.", "Raj: Yes, I’ll take you back.", "Lucy: Let me finish. It’s like I needed to go through that experience to know what exactly I don’t want in a man.", "Raj: Well, that’s hard to hear, but I’ll still take you back.", "Emily: You know, the same thing happened to me. After I broke up with Raj, I met Gary, who’s just amazing.", "Howard: Sorry, is that Gary with one R or two?", "Raj: Would you stop writing? Wait, so, did all of you go on to better relationships after me?", "Lucy: Oh, yeah.", "Emily: Without question.", "Claire: Little before, actually.", "Howard (responding to other Emily): Oh, wow. Don’t let him get away.", "Raj: What did she say?", "Howard: Uh, basically, she traded you for Bruce Wayne.", "Raj: Okay, maybe we should just end this.", "Howard: Wait, hang on. I just want to point out to everyone here, this is a man who is going to great lengths to better himself. Even at the risk of being humiliated. And I, for one, think that’s very brave.", "Raj: Thank you, Howard.", "Emily: Honestly, I’m surprised you two didn’t wind up together.", "Howard: Well, like you gals, I had to suffer through him to find Bernadette.", "Scene: Sheldon and Amy’s door. ", "Sheldon: Yes?", "Leonard: We owe you an apology.", "Sheldon: Oh, it’s fine. You needed a suitcase, I wasn’t home, you borrowed a suitcase.", "Leonard: That was six years ago. I’m talking about tonight.", "Sheldon: Oh. Well, I thought we were going in order.", "Penny: Look, we got really angry at each other, and you just got caught in the middle of it.", "Leonard: And, sorry about the suitcase.", "Sheldon: Yeah, well, you should be. Your socks were still in it. I had to throw it away. Anyway, I, uh, trust that you’ve resolved your conflict.", "Penny: Yes, we’re fine.", "Leonard: Mm, Penny’s gonna call her dad and tell him it’s not a good time for Randall to visit.", "Penny: Hopefully, he won’t be too upset.", "Leonard: Oh, you’re his little girl, he can’t stay mad at you.", "Penny: He won’t be mad at me. I mean, you’re the one who doesn’t want my brother to come, so…", "Leonard: So you’re gonna throw me under the bus?", "Penny: Oh, I’m gonna throw you so hard, I might actually win a stuffed animal.", "Sheldon: Uh, guys, it sounds like you’re getting angry again.", "Leonard: That’s because we are.", "Sheldon: Yes. I don’t need an emotion machine. I am one.", "Scene: Raj’s apartment. ", "Howard: Thanks, ladies, this was fun. Let’s not wait so long for another bizarre, awkward night.", "Raj: Well, that was a waste of time. I’m such an idiot.", "Howard: Don’t beat yourself up. That’s what I’m here for.", "Raj: Maybe I won’t settle down. Maybe I’ll just play the field.", "Howard: Yeah, the field was just here. The field said no.", "Raj: Dude, come on.", "Howard: Okay, I’ll tell you what. I’ll make you a deal. 30 years from now, if you’re still single and things don’t work out with me and Bernadette, you and I can give it a go.", "Raj: I appreciate the offer, but if things don’t work out with you two, I’m swooping in on her like a vulture.", "Howard: Too late. Stuart called dibs.", "Raj: But theoretically, if you and I were in a gay relationship, how would we tell people? Like, print up announcements?", "Howard: I don’t know. What difference does it make?", "Raj: Well, I want to make sure we get invited to all the parades. ", "Howard: Those do look fun.", "Raj: Yeah. Well, if you want to march in a fishnet crop top, you better lay off that dip.", "Howard: If you didn’t want me to eat it, why’d you put it out?", "Raj: It was for the girls. They broke up with me, I don’t care if they get fat.", "Howard: I’m not gonna get fat.", "Raj: Oh, you want to bet? You never exercise.", "Howard: Fine. Look, I’ll exercise right now. One, two. These are crunches, by the way.", "Raj: Very mature. Keep eating like that, you’re gonna have a heart attack.", "Howard: Okay. How about if I eat like this?", "Raj: You’re such a child.", "Howard: Hey, is that any way to talk to your future husband?", "Raj: Hey, I was being hypothetical, okay? I would never marry you.", "Howard: Please. When you see the ring I pick out, you’re gonna melt.", "Raj: Yeah, right. Wait, is it rose gold? Actually, don’t tell me, I want to be surprised.", "Scene: The apartment. ", "Penny: So, did you wind up sending that machine back?", "Sheldon: I did. You know, I’m not even sure how accurate it was. I took it to the train store, it said everyone was sad.", "Bernadette: I finally got Halley to sleep.", "Raj: You know, I just read a study that suggests new mothers are better at sensing emotions for up to two years.", "Amy: It’s true. Pregnancy causes physiological changes in the brain that result in increased empathy.", "Penny: So, all we need to do is get Sheldon knocked up.", "Leonard: We can’t. He was already fixed when I found him at the shelter.", "Sheldon: Hey, uh, Bernadette, let’s test this theory. What do you think I’m feeling right now?", "Bernadette: Let’s see. You’re better than us, a little bit sorry for us, but mostly glad you don’t have to be us.", "Sheldon: Keep filling this one with babies. She’s good."]}