{"series": "8", "episode": "20", "transcript": ["Scene: The cafeteria.", "Raj: You’re wrong.", "Howard: No, I’m not.", "Raj: Yes, you are.", "Howard: No, I’m not. Settle this. Those little animated pictures on the Internet, are they called gifs or jifs?", "Leonard: Well, the G stands for graphics. That’s a hard G, so I’d say gif.", "Raj: The guy who invented it says it’s jif.", "Howard: I’m sorry, do you mean the guy or the juy?", "Sheldon: Well, I’ll give you three guesses why I’m so irritated.", "Howard: Something happened different from the way you wanted it.", "Sheldon: I guess news travels fast. It’s true, a select group of scientists was invited to a weekend symposium at a former home of Richard Feynman, and I wasn’t included.", "Leonard: Oh, Sheldon, I’m sure it’s not because they don’t think you’re an elite scientist.", "Howard: Yeah, I bet you anything it’s just ’cause you’re a pain in the ass.", "Sheldon: You’re just saying that to make me feel better.", "Leonard: Look, you can spend the rest of the day being bitter about this.", "Sheldon: Agreed.", "Leonard: I was gonna say or, but why bother?", "Credits sequence.", "Scene: Mrs Wolowitz’s house.", "Bernadette: Hey, Raj.", "Raj: Hey, I got you a little gift.", "Bernadette: Oh, that’s a lot of Girl Scout Cookies.", "Raj: You know me. I’m from India. I can’t resist children begging. So, how’s it going with the title to the house?", "Howard: Great, it’s all done. The lawyer tracked down my father and got him to sign it over. I didn’t have to meet him, I didn’t have to talk to him, I don’t even know where he is.", "Raj: Wow, so you’re not curious at all?", "Howard: Nope.", "Raj: Hmm. What if he’s in prison? What if he’s a spy? What if he’s in a Beatles cover band? I’m just saying, if he’s got your nose and haircut, he’d make a killer Ringo.", "Scene: Penny’s apartment.", "Wil Wheaton: Thanks again for agreeing to do this.", "Penny: Oh, it’s cool, I’ve never been on a podcast before.", "Leonard: Well, you picked a good one to start. Wil’s had lots of great guests. Jonathan Frakes, Brent Spiner, Michael Dorn, Gates McFadden.", "Penny: Those are Star Trek people.", "Leonard: Yes.", "Penny: I only figured that out because I’ve never heard of any of them.", "Wil: I deserve that. I invited you on my show and I drove here.", "Penny: Sorry.", "Wil: Okay, so, this is basically gonna be just like a little talk show. Uh, we’re gonna take some calls, we’ll talk about what it was like on the set of Serial Ape-ist 2. It should be really fun.", "Leonard: This is exciting.", "Penny: Yeah, so, how many people listen?", "Wil: Most people download it later, but usually a few thousand people listen live.", "Penny: What? A few thousand people listen to you talk about nerd stuff?", "Wil: Again, right in the ears, straight to the feelings.", "Scene: The apartment. ", "Amy: Can you please pass the salt?", "Sheldon: Sure. It’s not like I was invited to Richard Feynman’s house and have anything better to do.", "Amy: Is this how the rest of the night’s going to be?", "Sheldon: I don’t know the future. Do you think there’s a chance that an asteroid could hit the Earth, destroying Feynman’s house and everyone in it?", "Amy: No, Sheldon.", "Sheldon: Then buckle up, you’re in for a cranky night.", "Amy: According to the codicil of the Relationship Agreement which you insisted upon, we’re not allowed to pout or be moody on date night.", "Sheldon: You know I just put that in because of uterus stuff.", "Amy: Well, it applies to you, too.", "Sheldon: I was afraid you might bring this up, so I have a work-around. There you go. As far as you’re concerned, I’m smiling. Although, I must admit, I’m smiling a little bit at the moment because this loophole is so brilliant.", "Scene: Mrs Wolowitz’s house.", "Raj: So, Bernadette, have you thought about how you’re going to redecorate this place?", "Bernadette: You know, I’m thinking ripping up the carpets, maybe lose the wallpaper, all new light fixtures.", "Raj: You know, if you knocked out this wall, it would give you an open floor plan, and then, it’s a little scary, but could be fun, indoor fire pit.", "Howard: Hey, I grew up in this house, okay? No one’s knocking anything down.", "Bernadette: Okay, okay. When he’s at Comic-Con, I’m bringing in a wrecking ball.", "Howard (answering door): Can I help you?", "Guy at door: Hi. Are you Howard Wolowitz?", "Howard: Yes.", "Guy: Um, this is a little weird, but a lawyer was trying to contact my father, because his name was still on the title for this house.", "Howard: Wuh, uh, who’s your father?", "Guy: Sam Wolowitz.", "Howard: Sam Wolowitz is my father.", "Guy: I know.", "Howard: Well, wait, so if we have the same father, are, are you saying you’re my half-brother?", "Guy: I think so.", "Howard: Bernadette, weird things are happening out here.", "Scene: Penny’s apartment. ", "Penny: I think I started to suspect it was a bad movie when I looked at the script and saw the title, Serial Ape-ist 2: Monkey See, Monkey Kill.", "Wil: Uh, spoiler alert, after the monkey sees, it kills.", "Leonard: Psst.", "Wil: I’ve just been handed a note. I’m going to read it. Wil, do you want more Diet Coke? Also, we have juice.", "Leonard: I, I didn’t want to interrupt.", "Wil: Uh, that voice you just heard belongs to Leonard, Penny’s fiancé. Uh, Leonard, why don’t you grab some headphones and join us?", "Leonard: Really?", "Wil: Yeah.", "Leonard: Hey, great.", "Wil: So, while Leonard gets set up, let’s take a call. Hello, caller, you are on with Penny and Wil from Serial Ape-ist 2.", "Caller: I don’t have a question. I just want to say I’m a big fan of the movie. I’ve seen it, like, ten times.", "Penny: Okay, well, I’ll apologize for the first time, but the other nine are on you.", "Wil: Thanks a lot, caller. You know that the movie actually has a little bit of a cult following.", "Penny: Really?", "Wil: Yeah. I was at a science-fiction convention, and I saw a woman dressed as your half-ape character.", "Leonard: Oh, if she was with an Indian guy dressed like a banana, that was just my friends, Howard and Raj.", "Wil: All right, it’s time for a very special guest caller, a friend of mine, who you probably know as the director of such movies as Clerks, or from podcasts and books where he often reminds you that he’s the guy who directed Clerks. Hello, Kevin Smith.", "Kevn: Hey, man, yo, is everything okay, Wil? ‘Cause it’s been, like, two minutes and you haven’t even brought up Stand By Me.", "Penny: Hey, Kevin. It’s really exciting to talk to you.", "Leonard: It really is.", "Kevin: Oh, you guys are very sweet. So, Penny, listen, I saw your movie.", "Penny: Oh, wow. I wish it was better.", "Wil: Oh, don’t worry about it. Have you seen some of Kevin’s films?", "Kevin: You’re cruisin’ for a beatin’, Wheaton. Anyway, man, I dug the ape movie, Penny. And I thought you were, like, really great in it.", "Penny: Aw.", "Wil: You know, I’m in the movie, too.", "Kevin: Yeah, whatever. Penny. Penny, how come you’re not in more stuff, man? I’d cast you in a minute.", "Penny: Seriously?", "Kevin: Oh, yeah, man. I’m actually in pre-production on a movie right now. Way different than anything I’ve ever done before. It’s called Clerks 3. You should come over and read for a part.", "Penny: Oh, my, I would love that.", "Leonard: You have a new job.", "Penny: Well, maybe I can do both.", "Leonard: I don’t think you can do both.", "Penny: I don’t think I asked you.", "Kevin: Yeah, you tell him, Penny.", "Leonard: Stay out of it, Kevin Smith.", "Scene: The apartment. ", "Sheldon: Do you think there comes a point in life when it stops feeling bad to be left out of things?", "Amy: Probably not. It’s an evolutionary advantage to be included in group activities.", "Sheldon: You know what? I used to be a fan of evolution, but I’ve since evolved, and now I think it’s dumb.", "Amy: Being left out is a terrible feeling. No one understands that better than I do.", "Sheldon: Hey, look at that. Even in your example, you’re all by yourself.", "Amy: When there was a lice epidemic at my school, everybody got it except me. I tried to fool everyone by sprinkling sugar in my hair, but I just got attacked by bees.", "Sheldon: I can just picture them all right now at Feynman’s house, probably discussing Schrodinger and at the same time, not discussing Schrodinger. See? They’re missing out on hilarious jokes like that.", "Amy: And at the same time, not.", "Sheldon: It reminds me of when my stupid brother and sister would build forts in the living room and wouldn’t let me in. I hated that so much.", "Amy: You know, there’s nothing I can do about getting you invited to the symposium, but if you wanted, we could build a fort.", "Sheldon: Isn’t that a little juvenile?", "Amy: More juvenile than this?", "Sheldon: I’ll get the blankets. You Google how to have childlike fun.", "Scene: Mrs Wolowitz’s house.", "Howard: You know what, I’m being a bad host. Let me get some more coffee.", "Bernadette: Oh, let me do it, Howard.", "Howard: No, I got it.", "Bernadette: So, Josh, what do you do?", "Josh: I’m studying oceanography down in San Diego.", "Bernadette: Oh, how nice. I loved Finding Nemo.", "Raj: Enough chitchat. How do we know you are who you say you are?", "Josh: Why would I lie?", "Raj: Okay, you got me there. You here looking for money?", "Josh: No.", "Raj: A kidney, cornea, piece of his liver?", "Josh: No.", "Raj: You’re in a Beatles cover band and you need Howard to replace your dad as Ringo.", "Bernadette: Why don’t you help with the coffee?", "Raj: Okay, but something smells fishy. And not just because you work around sea animals. That actually sounds interesting, and I’d like to learn more about it. Hey, you okay?", "Howard: Not really. This guy shows up out of the blue, and now I have a brother? My father has another family?", "Raj: I get it. What do you want to do?", "Howard: I don’t know. I, I’d just like him to go away. I can’t deal with this.", "Raj: All right, I’ve got your back.", "Howard: Thank you. Come on. And I’d like to point out, this wall just provided a lot of privacy.", "Josh: I can’t believe my brother’s an astronaut. That’s amazing. What was it like?", "Raj: Listen, dude, it’s time for you to hit the road.", "Howard: Hey, hey, the young man asked a good question.", "Scene: Penny’s apartment. ", "Wil: So, for those of you just tuning in, we are listening to a really fun fight between my co-star…", "Leonard: No, no, no. We’re not fighting, we’re just having a conversation.", "Wil: All right. We’re listening to a really fun conversation between my co-star from Serial Ape-ist 2 and her fiancé, who doesn’t believe women should have dreams.", "Leonard: Give me back that juice.", "Penny: What is the harm if I audition?", "Leonard: Well, what if you get it?", "Penny: I don’t know, I make a movie, become rich and famous, win an Oscar, a Golden Globe and live an incredibly wonderful life.", "Leonard: From a Kevin Smith movie?", "Kevin: Oh, I’m hanging up now.", "Wil: Don’t you listen to him, buddy. You’re awesome. You’re one of the greatest directors of our time.", "Kevin: I don’t have a part for you, Wheaton.", "Wil: And that was Kevin Smith.", "Penny: Thanks a lot.", "Leonard: I’m just trying to protect you. How many times did I see you get your heart broken trying to make it as an actress?", "Penny: Okay, instead of protecting me, why don’t you try being excited when something good happens?", "Leonard: I’m always excited for you. I’m excited that you found this new job where you’re making decent money.", "Penny: Decent? I make twice what you make.", "Leonard: Wait, twice?", "Penny: Yeah.", "Leonard: Like, times two twice?", "Wil: For those of you at home, Leonard just found out his fiancée makes way more money than he does. Let’s listen.", "Leonard: I went to school for half my life. I have a doctorate. I’m still paying off college loans.", "Penny: Well, how much do you owe? Maybe I can help you out.", "Leonard: Wil, can we just turn off the podcast for a little bit?", "Wil: For those of you at home, I am shaking my head no.", "Scene: The apartment. Including fort.", "Amy: How’s it going, Sheldon?", "Sheldon: Wonderful. I just finished hanging the lights.", "Amy: Can I come in?", "Sheldon: Yes, oh, but enter through the side. Batman is a load-bearing blanket.", "Amy: Amazing.", "Sheldon: I know. This isn’t the printout. This is my real face.", "Amy: What are we doing? This is a fort. Let’s sit on the floor.", "Sheldon: Roughing it? Okay. Everything looks so big from down here. This must be how Leonard feels.", "Scene: Mrs Wolowitz’s house.", "Howard: I’m surprised you could hear me with this Thin Mint in your ear. Yeah, pretty cool, huh?", "Josh: Yeah. Anyway, I should probably get going.", "Bernadette: Howie, have you noticed how often people say that when you start to do magic?", "Josh: Sorry, I have a long drive.", "Howard: Well, I hope I get to see you again.", "Josh: I hope so, too. I’ve always dreamed of having a brother to play catch with.", "Bernadette: Keep dreaming.", "Howard: Hey, I threw out the first pitch at an Angels game.", "Josh: Wow.", "Bernadette: He did it with a robot.", "Josh: You had sex with a robot?", "Howard: That’s not what she meant.", "Raj: But technically, yes.", "Scene: Penny’s apartment. ", "Leonard: Hang on, if you’re making all this money, where is it?", "Penny: In a safe place.", "Leonard: What does that mean, under your bed?", "Penny: No, it means a diversified portfolio of stocks and bonds. I’m not overly conservative. I’m young, so my guy said I can afford to take some risks.", "Leonard: Wait a minute, you have a guy?", "Penny: Don’t you have a guy?", "Leonard: Why would I have a guy? I don’t have any money.", "Penny: Oh, sweetie, you should really get some money.", "Wil: For those of you listening at home, how great is this?", "Leonard: Wil, I’m begging you, just please turn that off.", "Wil: Sure. And we’re back.", "Penny: Leonard, why are you making such a big deal out of this? So our roles have changed a bit over the last couple years. This is the way life is. And I’m sure in time they’ll change again.", "Leonard: Great, you’re not only more successful than me, now you’re more mature.", "Penny: Okay, look, would it make you feel better if I did something dumb like sneak out of work one day to go audition for a Kevin Smith movie?", "Leonard: That would be great, thank you.", "Wil: I’m just gonna jump in here real quick. Leonard, a moment ago, you were dead set against Penny resuming her acting career, but now you’re all for it. Is it fair to say that she played you like a violin?", "Leonard: Yes, it is, Wil.", "Scene: Mrs Wolowitz’s house.", "Josh: So, I have to ask, was the robot sexy?", "Howard: It was actually just a mechanical hand.", "Josh: ‘Cause that’s all you need, right?", "Howard: You are my brother.", "Scene: The fort.", "Sheldon: Okay, so the final four forts in the first annual best fort ever contest, or fort off, are, Fort Knox, Fort Ticonderoga, Fort Sumter and Fort Cozy McBlanket.", "Amy: I’d say, Knox over Ticonderoga, ’cause it’s got the gold.", "Sheldon: Mm-hmm.", "Amy: And McBlanket over Sumter ’cause it has a higher thread count. Oh. Ten o’clock. Date night’s over.", "Sheldon: Wait, no. We haven’t picked a winner.", "Amy: We both know this one’s gonna win.", "Sheldon: Well, of course we do. Fort Knox doesn’t have a secret physics lending library.", "Amy: Come on, I’ll help you take this down.", "Sheldon: Well, wait. What if, just this once, we suspend the date night parameters and you stay later?", "Amy: Well, as long as we’re suspending the parameters, I could stay really late and we could have our first sleepover.", "Sheldon: That’s a big step.", "Amy: It’s a big fort.", "Sheldon: Very well. I will agree to a family-friendly, G-rated, boy-girl sleepover.", "Amy: PG. Some scenes may be too intense for younger viewers.", "Sheldon: G-rated, with a warning for families with babies and toddlers.", "Amy: You got yourself a sleepover.", "Sheldon: Do you need to borrow a toothbrush or pajamas?", "Amy: Would it alarm you to know that I hid those things here two years ago just in case this ever came up?", "Sheldon: It would, but you know how much I admire preparedness. How did you know we’d be in the living room?", "Amy: Who says this is the only one I hid?", "Scene: The apartment. ", "Leonard: Hello? What is this?", "Sheldon: We built a fort.", "Leonard: Are those my sheets?", "Amy: Yes, they are.", "Leonard: Okay. Well, you kids have fun. I’m gonna go to sleep.", "Sheldon: Well, Leonard, don’t you want to see the inside of the fort?", "Leonard: Yeah, I’m good.", "Sheldon: Oh, come on. I really wanted to tell someone they can’t come in.", "Leonard: Okay, fine. Sheldon, may I please visit your fort?", "Sheldon: I want to say no, but it’s too glorious. Get in here.", "Leonard: Thank you.", "Amy: Okay, have a seat on the floor.", "Sheldon: Not there. That’s my spot."]}