{"series": "2", "episode": "19", "transcript": ["Scene: The apartment.", "Penny: Okay, it’s done. Look, guys, for the future, I don’t mind killing the big spiders, but you have to at least try with the little ones.", "Sheldon: Penny, please, we’re facing a far more serious problem than stray arachnids.", "Leonard: Sheldon, it’s not that bad.", "Sheldon: Not bad? It’s horrible. I mean, you hear stories about this sort of thing, but you never think it’ll happen to you.", "Leonard: So they steamed your dumplings, get over it. New topic, please.", "Howard: All right, Penny, let me take this opportunity to point out that you are looking particularly ravishing today.", "Penny: Not with a thousand condoms, Howard.", "Howard: So, there is a number.", "Penny: Okay, new topic, please. Hey, did you hear the people upstairs in 5A are moving out?", "Leonard: Shh-shh-shh!", "Sheldon: What?", "Penny: The people upstairs are moving out.", "Leonard: No!", "Sheldon: The horror!", "Leonard: Why would you just say something like that?", "Sheldon: No, no, no, no, no, no, no…", "Penny: How else was I supposed to say it?", "Leonard: Slowly, like putting a new fish in a tank. You don’t just drop it in, you let the bag sit in the water a while.", "Sheldon: The horror!", "Penny: Sheldon, I’m sure it’s going to be fine.", "Sheldon: No, it’s not going to be fine, change is never fine. They say it is, but it’s not.", "Penny: Okay, honey, did you even know the people that are moving out?", "Sheldon: I never met them. That’s what made them perfect, there were no awkward hellos in the halls, there was no clickety-clacking of high heel shoes on hardwood floors, they may as well have been a family of cats just jumping around from drape to drape without that annoying ammonia urine smell.", "Penny: Well, I’m sure the new people will be just as quiet.", "Sheldon: You can’t know that. How can you possibly know that?", "Penny: You’re right, I can’t. You know what? Anyone could rent that apartment now, an opera singer, the cast of stomp, yeah, a tap-dancing pirate with a wooden leg.", "Leonard: Why are you making it worse?", "Penny: I tried making it better, he wouldn’t go for it.", "Howard (after Raj whispers to him): You’re right, that’s a great idea.", "Leonard: What?", "Howard: I’ll take the apartment upstairs. I can finally get away from my mother, and we can all spend some more time together, if you catch my drift.", "Penny: The horror!", "Credits sequence.", "Scene: Outside Howard’s house.", "Sheldon: Hold on. You honestly expect me to believe that social protocol dictates we break our backs helping Wolowitz move, and then he only need buy us a pizza?", "Leonard: I’m sorry, that really is how it works.", "Sheldon: You’re tricking me. You tell me the truth, what do we get?", "Leonard: Raj, help me out here.", "Raj: You get to choose between a mountain bike or a PS3.", "Sheldon: I knew it! PS3, definitely  PS3, who would pick a mountain bike?", "Howard (voice from inside): Enough with the guilt, ma, we’ll still see each other. I’ll come over every night and have dinner with you.", "Howard’s Mother (voice): The hell you will! What am I running here, a fancy restaurant? Does this look like Olive Garden?", "Howard (voice): Okay, I get it, you’re angry. You don’t want to see your little bird leave the nest.", "Howard’s Mother (voice): Little bird? You’re almost 30, fly, for god’s sake!", "Howard (voice): Fine, I’ll stay! You happy, crazy lady? I sure as hell hope so, because you’re ruining my life!", "Leonard (into phone): Hey, Penny, it’s Leonard. Good news, you can take your head out of the oven.", "Sheldon (removing hernia support): I guess I won’t be needing this.", "Scene: The lobby, there are boxes everywhere and removal men are carrying them up the stairs.", "Sheldon: Oh, no, the new ones, they’re here.", "Leonard: Stay calm, we don’t know anything about them yet. What are you doing?", "Sheldon: I’m checking for musical instruments. Does that sound like castanets to you?", "Leonard: The box says kitchen.", "Sheldon: So? Do cocaine smugglers write cocaine on the box?", "Blonde girl (arriving): Hello?", "Leonard: Hello.", "Sheldon: Hello.", "Blonde Girl: Hello.", "Leonard: Hello.", "Sheldon: Hello.", "Blonde Girl: I’m Alicia. I’m moving in upstairs.", "Leonard: That is so great. Oh, I’m Leonard, I live downstairs. Upstairs from here, but under you. Not under you per se, but under your apartment.", "Alicia: That’s nice.", "Leonard: Yeah, it is.", "Sheldon: If that concludes your faltering attempt to mate, hello.", "Alicia: Hello.", "Sheldon: Hello. On a scale of one to ten how light of foot would you describe yourself with one being not cat-like at all and ten being freakishly feline?", "Alicia: Freakishly feline?", "Sheldon: Is that your answer or do you not understand the question? We’ll come back to that one.", "Leonard: Sheldon…", "Sheldon: Hang on. Are you now or have you ever been a salsa, Irish folk or break-dancer?", "Alicia: No.", "Leonard: You’re making her uncomfortable.", "Sheldon: Oh, I’m sorry. Well, if it helps you feel any better you’re doing very well so far. Next question, are you fertile?", "Alicia: What?!", "Sheldon: I’m trying to determine whether crying infants above my head are a possibility.", "Alicia: I have no immediate plans.", "Sheldon: If that changes, let me know. And finally, area rugs, pro or con?", "Alicia: Pro?", "Sheldon: Alicia?", "Alicia: Yes?", "Sheldon: Welcome to the building.", "Scene: The stairs", "Alicia:Thanks so much for helping me, Leonard.", "Leonard: Thank you so much for giving me the opportunity to help.", "Penny (exiting apartment): Oh, hey, guys.", "Leonard: Hey, Penny. this is Alicia, our new neighbour.", "Penny: Hi.", "Alicia: Hi.", "Leonard: I’m helping.", "Penny: I can see.", "Sheldon: Alicia’s non-musical, childless and pro-rug. She’s still on probation, of course, but I like her.", "Alicia: Cool t-shirt.", "Penny: Oh, yeah, I don’t usually dress like this. I’m going jogging.", "Sheldon: You don’t jog.", "Penny: I can start.", "Sheldon: True, but the more likely explanation for your attire is that you’re out of clean clothes again.", "Penny: Thank you, Sheldon.", "Sheldon: You’re welcome, Penny.", "Alicia: Please, you look cute. I’m dressed like a slob today, too.", "Leonard: I think you look fantastic.", "Alicia: This one’s a player, huh?", "Penny: Oh, yeah, be careful.", "Alicia: Thanks for the warning.", "Penny: Okay.", "Alicia: I’ll see you around.", "Penny: See ya. I’m dressed like a slob today, too.", "Sheldon: Oh, mimicry. I enjoy mimicry. I’ve been working on Admiral Ackbar from Return of the Jedi. “It’s a trap.” You have to imagine me with a giant squid head. “It’s a trap. It’s a trap. It’s a trap.”", "Scene: The apartment. Sheldon is writing on an imaginary board. There is a knock on the door.", "Sheldon: Come.", "Penny (entering): Hey.", "Sheldon: Congratulations, I see you did your laundry.", "Penny: Well, sort of.", "Sheldon: How does one sort of…", "Penny: I bought new clothes, okay? Is Leonard around?", "Sheldon: He’s upstairs at Alicia’s.", "Penny: Oh. all right, that’s cool, no biggie. He said he’d help me set up my printer, but I guess I can wait. What exactly is he doing up there?", "Sheldon: In what I can only perceive as a tactical move to destroy me, he is with Wolowitz and Koothrappali setting up her stereo.", "Penny: Oh, they’re all up there, huh? Hmm, typical.", "Sheldon: It’s axiomatically atypical. Up until recently, they did not know Alicia, and had no encounters with her in a previous location. They never went upstairs to visit the former tenants, so your characterization of their behaviour as typical Is demonstrably fallacious.", "Penny: Okay, now I see the giant squid head. (Leaves)", "Sheldon: Oh, great! now, I have to start all over again. (Rubs out imaginary workings)", "Scene: Alicia’s apartment.", "Howard: Yeah, I thought about renting this apartment, but I’m really more of a downtown loft kind of guy.", "Alicia: Cool. so are you in a loft now?", "Howard: Oh, actually I’m, uh, living with a woman in Altadena. Purely platonic, she’s also my maid.", "Alicia: Sounds like a sweet deal.", "Howard: I won’t lie, it’s pretty dope.", "Penny (arriving): Hello?", "Alicia: Oh, hey.", "Penny: Hey, I just wanted to bring you a little housewarming gift.", "Alicia: That is so sweet. Come on in, let’s open it.", "Penny: Great.", "Alicia: Nice dress.", "Penny: Oh, this? I’m dressed like a slob today.", "Alicia: The guys have been helping me set up my sound system. I’ve never had such good-looking technical support.", "Howard: Oh, pish-posh. (Raj whispers to him) I don’t know, it means shucks. (Raj whispers again) Shucks means shucks. Let one go once in a while.", "Leonard: Hey, uh, penny, you want to hear something awesome?", "Penny: Yeah.", "Leonard: Alicia is an actress, just like you.", "Penny: That is so awesome.", "Alicia: Well, trying to be, but it’s so hard.", "Penny: Yeah, I know, tell me about it.", "Alicia: I’ve been out here three months, and all I’ve gotten is a couple of national commercials and this recurring thing on a soap.", "Penny: That’s why I work at the Cheesecake Factory, I’m holding out for the right part.", "Leonard: Alicia, what do you want as your default setting for DVDs, 5.1 Dolby or DTS?", "Alicia: Whatever you think is best, cutie.", "Leonard: Well, DTS has more low end, so… okay.", "Penny: Uh, hey, guys, guys, you will really appreciate this, I read the best science joke on the internet. Alicia, you won’t get it, but it’s right up their alley. Anyway, so, this physicist goes into an ice cream parlour every week and orders an ice cream sundae for himself, and then offers one to the empty stool sitting next to him. This goes on for a while until the owner finally asks him what he’s doing. The man says, “well, I’m a physicist, and quantum mechanics teaches us that it is possible for the matter above this stool to spontaneously turn into a beautiful woman who might accept my offer and fall in love with me.” The owner then says, “well, lots of single, beautiful women come in here every day, why don’t you buy an ice cream for one of them, and they might fall in love with you?” And the physicist says, “yeah, but what are the odds of that happening?”", "Leonard: It’s a little insulting, don’t you think?", "Penny: How would I know? I’m not even sure I get it.", "Alicia: Hey, Leonard? If you’re done with the DVD player, can you set up my printer?", "Leonard: Uh, yeah, I’d love to.", "Penny: Uh, hey, maybe when you’re done with her printer, you could set up mine. You know, like you promised a week ago.", "Leonard: Yeah, I’ll get to it, don’t nag me.", "Raj (drinking some wine): Hello there", "Scene: The apartment. Penny walks in without knocking and collapses on the sofa.", " ", "Sheldon: Who is it? Oh hello, Penny, it’s open, come in. Sarcasm.", "Penny: Well, they’re all still up there.", "Sheldon: You think I can’t hear them? Listen to that. Stomp, stomp, stomp. That’s Wolowitz in his stacked heels that fool no one.", "Penny: I don’t even know why I care. I don’t care. All right, I cared enough to memorize that stupid joke, but that’s all I care.", "Sheldon: You know, Penny, there’s something that occurs in beehives you might find interesting. Occasionally, a new queen will arrive while the old queen is still in power. When this happens, the old queen must either locate to a new hive or engage in a battle to the death until only one queen remains.", "Penny: What are you saying, that I’m threatened by Alicia? That I’m like the old queen of the hive and it’s just time for me to go?", "Sheldon: I’m just talking about bees. They’re on the discovery channel. What are you talking about?", "Penny: Bees. Aaah! I just got that physicist joke.", "Scene: The apartment.", " ", "Leonard: Gee, Penny, thanks for buying us dinner.", "Howard: Yeah, what’s the occasion?", "Penny: No, no occasion, just felt like getting some Chinese chow for my peeps.", "Sheldon: Did you remember to ask for the chicken with broccoli to be diced, not shredded?", "Penny: Yes.", "Sheldon: Even though the menu description specifies shredded?", "Penny: Yes.", "Sheldon: Brown rice, not white?", "Penny: Yes.", "Sheldon: You stop at the Korean grocery and get the good hot mustard?", "Penny: Yes.", "Sheldon: Did you pick up the low-sodium soy sauce from the market?", "Penny: Yes", "Sheldon: Good. See how it’s done, Leonard?", "Penny: So, what do we got going on tonight, huh? Playing Halo watching Battlestar, drop some mentos in diet coke?", "Leonard: You want to watch Battlestar?", "Penny: What can I say? I got my geek on, boys.", "Howard (after Raj whispers to him): No, no, PMS is different. (There is a knock on the door. Leonard answers it.)", " ", "Alicia: Oh, thank God you’re home. I need help.", "Leonard: What’s wrong?", "Alicia: I just got a callback to audition for CSI to play a hooker who gets killed.", "Leonard: Oh, I’d watch that.", "Alicia: But my car is in the shop, and I have to be at Universal in forty-five minutes.", "Leonard: Okay, well, I’ll take you.", "Alicia: Oh, you’re a lifesaver.", "Howard: I’ll run lines with you in the car.", "Alicia: Great. And afterward, I’ll take you all out for Chinese.", "Penny: Oh, actually, that’s okay. we already have…", "Howard: Yum. Starving.", "Penny: …chinese food right here.", "Sheldon: They’re gone, Penny. They can’t hear you.", "Penny: I cannot believe they’re letting her just use them like that. I mean, anything she wants, they go panting after her like trained dogs. You know that just last week, she had Howard drive all the way to her uncle’s house in Orange County to pick up her TV?", "Sheldon: You once had Leonard and me get your television from your ex-boyfriend.", "Penny: Apples and oranges here, Sheldon. I’m telling you, that girl is a user, iceskating through the life on her looks, taking advantage of innocent weak-willed men, getting auditions for stupid network shows. It creams my corn.", "Sheldon: May I interject something here?", "Penny: Please.", "Sheldon: You got the wrong mustard.", "Scene: The laundry room. ", " ", "Alicia: Hi.", "Penny:", "Alicia: Guess what? I got the part on CSI.", "Penny: Oh boy.", "Alicia: Something wrong?", "Penny: Uh, no. No, no, no, you know, congratulations, I think you’ll make a great hooker.", "Alicia: Thank you. Hey, I got to ask you something, how much do physicists make?", "Penny: Um, I don’t know, I don’t think a lot.", "Alicia: Yeah, that’s what I figured. Well, got to run, the guys promised to set up my satellite dish and paint my bedroom. Yay!", "Penny: Um, hey, hey, can I talk to you about that for a second?", "Alicia: About what?", "Penny: Well, you know, it’s just that Leonard and Howard and Raj, they aren’t like other guys. They’re special.", "Alicia: Okay, they’re special, and?", "Penny: Oh, let’s see, how can I explain this, um, they don’t know how to use their shields.", "Alicia: Shields?", "Penny: Yeah, you know, like in Star Trek, when you’re in battle and you raise the shields? Where the hell did that come from? Anyways, um, you know how guys like this are, so, please don’t take advantage of them.", "Alicia: Who says I’m taking advantage of them?", "Penny: Come on, they’re doing everything for you, because you’re leading them on.", "Alicia: So I let them do stuff for me. They’re happy. I get stuff. Who cares? And how’s it any different from what you do?", "Penny: Excuse me?", "Alicia: I’ve seen you around them. Are you pretending like you don’t do the exact same thing?", "Penny: Okay, lady, you are way out of line.", "Alicia: Oh, I’m out of line?", "Penny: Yeah, you’re out of line.", "Alicia: Well, what are you going to do about it, bitch?", "Scene: Outside the building.", "Raj: I like green lantern, I’m just saying it’s pretty lame that He can be defeated by the colour yellow.", "Sheldon: Only the modern green lantern is vulnerable to yellow.", "Leonard: Golden age green lantern was vulnerable to wood.", "Raj: Great, so I can take them both out with a number-two pencil?", "Howard: Oh, my God! Girl fight! (He grabs Leonard)", "Leonard: What are you doing?", "Howard: I know you. you’re stupid enough to break it up.", "Scene: The apartment. Penny has a black eye.", " ", "Howard: May I say you look very comely tonight?", "Penny: Thank you.", "Howard: You’re right, this filly’s been broken.", "Sheldon (as music comes down through ceiling): You set it on DTS, didn’t you?", "Leonard: I had to, she called me cutie.", "Howard: According to Alicia’s facebook page, she’s hooking up with one of the producers on CSI.", "Penny: Well, dead whore on TV, live one in real life.", "Sheldon: Oh, great now she’s jumping up and down on the bed."]}