{"series": "2", "episode": "23", "transcript": ["Scene: The apartment. Leonard is working on a whiteboard.", "Sheldon: Oh, boy.", "Leonard: What?", "Sheldon: I can’t comment without violating our agreement that I don’t criticize your work.", "Leonard: Then what was oh, boy?", "Sheldon: Great restraint on my part.", "Leonard: There’s nothing wrong with the science here.", "Sheldon: Perhaps you mean a different thing than I do when you say science.", "Leonard (making a change): Okay, how’s that?", "Sheldon: You actually had it right in the first place. Once again, you’ve fallen for one of my classic pranks. Bazinga! Well, now here’s a peculiar e-mail. The president of the university wants me to meet him at his office tomorrow morning at 8 a.m.", "Leonard: Why?", "Sheldon: It doesn’t say. It must be an emergency. Everyone at the university knows I eat breakfast at eight and move my bowels at 8:20.", "Leonard: Yes, how did we live before Twitter? I guess you’ll find out what it is in the morning.", "Sheldon: That’s 14 hours away. For the next 840 minutes, I’m effectively one of Heisenberg’s particles, I know where I am or I know how fast I’m going, but I can’t know both. Yet how am I supposed to carry on with this huge annoying thing hovering over my head?", "Leonard: Yeah, I know the feeling.", "Credits sequence.", "Scene: Outside Leonard’s bedroom.", "Sheldon: (Knock, knock, knock) Leonard. (Knock, knock, knock) Leonard. (Knock, knock, knock) Leonard.", "Leonard: Sheldon, it’s two o’clock in the morning.", "Sheldon: Why is everybody keep telling me what time it is?", "Leonard: Everybody?", "Sheldon: You, the president of the university, his wife, their sullen teenage daughter. That entire family is fascinated by what time it is and whether people know it.", "Leonard: You went to President Seibert’s house in the middle of the night?", "Sheldon: He didn’t respond to my e-mail, his phone number is unlisted. Tell me what my other option was.", "Leonard: You could have waited until morning. I know, look who I’m talking to.", "Sheldon: Do you remember the grant proposal I submitted to the National Science Foundation to detect slow-moving monopoles at the magnetic North Pole?", "Leonard: Hardly a day goes by when I don’t think about it.", "Sheldon: Aw, how nice. Well, a space opened up at the last minute on the NSF expedition to the Arctic Circle.", "Leonard: Wait a minute. He offered to send you to the North Pole?", "Sheldon: Yes. In fact, he was quite enthusiastic. He said, “Frankly, if I could send you tonight, I would.”", "Leonard: Okay, well, do you want to go?", "Sheldon: Of course not. I’m a theoretical physicist, a career I chose in no small part because it’s indoors, but if I’m able to detect slow-moving magnetic monopoles there, I will be the scientist to confirm string theory. People will write books about me. Third-graders will create macaroni-art dioramas depicting scenes from my life.", "Leonard: Sure, maybe a tableau of me trying to pummel you to death.", "Sheldon: Sarcasm?", "Leonard: Maybe.", "Sheldon: I’m on the horns of a dilemma. Can you imagine me, Sheldon Cooper, at the North Pole?", "Leonard: Easy peasy, I’m doing it right now.", "Sheldon: I’m not good with cold, Leonard. How often have we had to leave a movie theatre because I got a headache from drinking the Icee too fast? I can’t go.", "Leonard: Well, then don’t go.", "Sheldon: How can you say that? The scientific opportunity of a lifetime presents itself and my best friend says don’t go.", "Leonard: All right, then go.", "Sheldon: Listen to you. How can I possibly go?", "Leonard: Sheldon, what are the words I can say right now to end this conversation and let me go back to sleep?", "Sheldon: Odd, President Seibert posed the exact same question.", "Leonard: How was it resolved?", "Sheldon: It wasn’t. His wife set their dogs on me and rendered the question moot.", "Scene: The stairwell.", "Howard: Just imagine. If he says yes, we’ll have an entire summer without Sheldon.", "Raj: We could play outside.", "Howard: We could sit on the left side of the couch.", "Leonard: I could use the bathroom at 8:20.", "Raj: Our dreams are very small, aren’t they?", "Sheldon: Good news, gentlemen, I have tentatively accepted…", "All: Yeah! Woo-hoo!", "Sheldon: …the invitation to join the Arctic Expedition.", "Leonard: It’s not gonna be the same without you.", "Howard: Godspeed.", "Sheldon: Thank you, but your sentiments may be premature.", "Raj: Ooh, I don’t like where this is going.", "Sheldon: I would like to propose that the three of you accompany me.", "Howard: To the North Pole?", "Sheldon: Yes.", "Raj: Is this just so we won’t touch your stuff while you’re away?", "Sheldon: I’ll admit that was a concern. But the fact is, I’ll need a support team. And the three of you are my first choice.", "Howard: Really?", "Sheldon: Well, there are others who might be more qualified, but the thought of interviewing them gave me a stomach ache. Now, I know I’m proposing an enormous undertaking, so why don’t you take a few moments to discuss it?", "Howard: We’re not really gonna go to the North Pole with him, are we?", "Sheldon (voice): I’m still within earshot! You may want to wait for my door to close.", "Howard: We’re not really gonna go to the North Pole with him, are we?", "Leonard: Hang on. Let’s talk about it. This is a National Science Foundation expedition. I don’t know how we can turn it down.", "Howard: Easy. Instead of saying, no, we don’t want to go on an NSF expedition, say, no, we don’t want to spend “three months stuck in a cabin in the Arctic Circle with an anal nutbag.”", "Raj: But if we were part of the team that confirmed string theory, we could drink for free in any bar in any college town with a university that has a strong science program.", "Leonard: Howard, this is big science. You could be the engineer who builds the equipment that puts us on the cover of magazines.", "Howard: I could also be the engineer who builds the crossbow that kills Sheldon.", "Raj: You still might get on a magazine.", "Howard: So you guys are seriously considering this?", "Leonard: Yes.", "Howard: And you think you can put up with Sheldon?", "Raj: Well, I’m a Hindu. My religion teaches that if we suffer in this life we are rewarded in the next. Three months at the North Pole with Sheldon and I’m reborn as a well-hung billionaire with wings!", "Sheldon: Well, gentlemen, have you reached a decision?", "Leonard: I’m in.", "Raj: Me, too.", "Howard: Oh, damn it. Peer pressure. Fine.", "Sheldon: Excellent. And just an FYI, as I am the expedition’s team leader, protocol dictates that be phrased fine, sir. But don’t worry, there will be a briefing.", "Scene: Outside Penny’s door.", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: (Knock, knock, knock) Sheldon.", " ", "Sheldon: (Knock, knock, knock) Penny.", "Penny: What do you want?", "Sheldon: I need access to the Cheesecake Factory’s walk-in freezer.", "Penny: Now, honey, I already told you, the hamburger meat is fresh and stored at a safe temperature.", "Sheldon: No. This is to train for a three-month expedition to the magnetic North Pole.", "Penny: What?", "Sheldon: I don’t know how that sentence could possibly confuse you, but to elaborate, I’m going to the Arctic Circle with Leonard, Wolowitz and Koothrappali.", "Penny: You’re all going?", "Sheldon: Yes.", "Penny: For three months?", "Sheldon: Yes.", "Penny: Excuse me.", "Sheldon: Is that a yes or a no on the freezer? The woman has the attention span of a gnat.", "Penny: Hey, Leonard.", "Leonard: Hi.", "Penny: Sheldon says you’re going to the North Pole.", "Leonard: Yeah. Pretty cool, huh?", "Penny: Yeah. I’m just a little surprised you didn’t tell me.", "Leonard: Oh, well, it all happened kind of fast, and we had to get physicals and buy thermal underwear and study up on, you know, snow and stuff. Sorry, I was gonna tell you.", "Penny: Oh, hey, no, you don’t have to apologize. There’s no reason you have to tell me. I was just, you know, surprised.", "Sheldon: Yes, yes, you were busy, you were surprised, all very fascinating. Now where do we stand on the freezer?", "Penny: Is he serious?", "Leonard: Actually, it would help.", "Penny: All right, I’ll see what I can do. So, three months at the North Pole. Wow, that is awesome.", "Leonard: Yeah.", "Sheldon: I’m sorry, but at what point do you put this see what you can do plan into action?", "Penny: Just a warning, Sheldon, the freezer locks from the outside.", "Leonard: Did she seem upset to you?", "Sheldon: No. Did she seem upset to you?", "Leonard: No.", "Sheldon: Oh, good, I got it right. Are you upset?", "Leonard: A little bit.", "Sheldon: Two for two. I’m on fire.", "Leonard: I mean, I know she’s not my girlfriend or anything, but wouldn’t you think she’d feel a little bad that I’m going to be gone for the whole summer?", "Sheldon: That feels like a bonus question. I’m going to stop here while I’m ahead, but I’ve had a great time.", "Scene: Inside the cheesecake factory freezer.", " ", "Sheldon: Alright, now the purpose of this drill is to acclimate us to the use of tools in extreme temperatures such as we will face in the Arctic Circle.", "Raj: Where are your tools?", "Sheldon (pointing at his brain): Right here. All right, team, open up your practice kits. As the university did not permit me to bring the actual equipment we’ll be using to the Cheesecake Factory, because apparently I’m “ridiculous,” I’ve provided substitutes which will exercise your fine motor skills. Leonard, you will be doing a series of complex mathematical problems on a vintage Casio model 1175 calculator watch I received when I won the Earth Science medal in 3rd grade. Treat it with respect. Raj, you will be painting sideburns and a Van Dyke on a six-inch figurine of Legolas the elf. Now, remember, a Van Dyke is a goatee without a moustache. Wolowitz, you will be completing a series of delicate surgical procedures on the classic children’s game, Operation. To begin with, you will remove funny bone for two hundred dollars.", "Howard: For this I went to MIT.", "Sheldon: And begin.", "Raj: I think I swallowed some paint!", "Leonard: I can’t press any of the buttons with my gloves. Oh, son of a bitch!", "Sheldon: Adversity is to be expected. Continue.", "Howard: Oh, boy, am I gonna get sued.", "Leonard: Okay, I can’t do this.", "Raj: Me either.", "Sheldon: Gentlemen, use your imagination. Innovate. Did Han Solo let Luke Skywalker freeze to death on the ice planet of Hoth? No. He cut open a tauntaun and used its internal body heat to warm him up.", "Howard: You heard the man. Hold him down and I’ll cut him open.", "Leonard: Hang on, I know I don’t possess the tools of leadership, but I don’t understand why we can’t assemble the equipment inside the hut and then take it outside.", "Sheldon: I hadn’t thought of that. I guess we’re done here.", "Scene: The apartment kitchen.", " ", "Sheldon: Here, drink slash eat this.", "Leonard: What is it?", "Sheldon: It’s hot chocolate with a stick of butter.", "Howard: Okay, why?", "Sheldon: Because in the frigid temperatures in the Arctic, we need to consume at least 5,000 calories a day just to maintain our body weight.", "Leonard: Sheldon, you know I can’t eat butter. I’m lactose intolerant.", "Sheldon: Way ahead of you, that’s an “I Can’t Believe It’s Not Butter” stick.", "Raj (on his webcam): But mummy, all the other guys are going to the North Pole.", "Mrs Koothrappali: I don’t care what the other guys are doing. If the other guys jumped in the Bay of Bengal and tried to swim to Sri Lanka, would you follow them?", "Raj: If you were standing behind me nagging, I might.", "Dr Koothrappali: Don’t talk back to your mother. This trip is much too dangerous, Rajesh.", "Raj: No, it’s not. Howard, tell them.", "Howard: Doctor and Mrs. Koothrappali, namaste. I understand your concern, but if it’ll make you feel any better, my mother is fine with me going, and this is a woman who kept a safety rail on my bed until I was 17.", "Mrs Koothrappali: So, she has no problem with her son being eaten by a walrus?", "Sheldon: That’s very unlikely, Mrs. Koothrappali. If Raj dies, it’ll be from frostbite, gangrene, acute sunburn or being ripped to shreds by a fifteen hundred pound polar bear.", "Howard: Ma, I’m putting you on speakerphone with Raj’s parents. Can you tell them that you’re okay with me going to the Arctic?", "Howard’s Mother: Arctic? I thought you said Arkansas!", "Howard: I didn’t say that. You never listen to me!", "Howard’s Mother: He doesn’t tell me anything! He lives a secret life because he’s ashamed!", "Penny (arriving): Hey, Leonard, can I talk to you for a sec?", "Leonard: Sure, but let’s go out here where there’s a little less yelling and guilt. What’s up?", "Penny: Well, I got you a little going away present.", "Leonard: Oh, a blanket.", "Penny: Oh, no, no, no, not just a blanket. See, it has sleeves. Yeah!  So, you can, you know, be all snoodled up while you do your science stuff.", "Leonard: Oh, wow, cool.", "Penny: Oh, I’m gonna miss you. (She hugs him for a long time) See you later.", "Leonard: Bye.", "Mrs Koothrappali: I told you no. Why don’t you believe me?", "Howard’s Mother: ‘Cause it doesn’t make sense to me! How can it be that in the entire country of India, there isn’t one Outback Steakhouse?!", "Scene: Sheldon’s bedroom. Sheldon is asleep. There is a knock on the door.", "Leonard: Sheldon, Sheldon?", "Sheldon: I want a cookie, Meemaw.", "Leonard: Sheldon, it’s me.", "Sheldon: But Meemaw just made cookies.", "Leonard: Listen, I don’t know if I can go on the expedition.", "Sheldon: What?", "Leonard: I don’t think I can go to the North Pole.", "Sheldon: Okay, Leonard, I know you’re concerned about disappointing me but I want you to take comfort from the knowledge that my expectations of you are very low.", "Leonard: Yeah, that’s very comforting.", "Sheldon: Comforting is a part of leadership. It’s not a part I care for, but such is my burden.", "Leonard: Terrific, it’s just that I don’t think Penny wants me to go.", "Sheldon: Assuming that’s a valid reason not to go, which it isn’t, how do you know this? Did she say it?", "Leonard: Not exactly. But she said she was gonna miss me and she gave me this.", "Sheldon: What is it?", "Leonard: It’s a blanket with sleeves.", "Sheldon: Oh, that’s clever. Let me see if I understand this correctly. Her missing you is an emotional state you find desirable?", "Leonard: Yes, obviously.", "Sheldon: All right. Well, given that missing you is predicated on you leaving, logic dictates you must leave.", "Leonard: Yes, okay, but I’m gonna be gone for three months. What if she doesn’t miss me that long and she meets someone else?", "Sheldon: She does have a short attention span.", "Leonard: So, I can’t go.", "Sheldon: Leonard, you may be right. It appears that Penny secretly wants you in her life in a very intimate and carnal fashion.", "Leonard: You really think so?", "Sheldon: Of course not. Even in my sleep-deprived state, I’ve managed to pull off another one of my classic pranks. Bazinga!", "Scene: Outside Penny’s door. Leonard is knocking.", "Penny: Oh, Leonard, what time is it?", "Leonard: It’s 7 a.m. I’m sorry it’s early, but we’re leaving soon, and I needed to talk to you.", "Penny: Okay.", "Leonard: What did you mean when you said you’re going to miss me?", "Penny: Um, I don’t know. You’ll be gone and I’ll notice.", "Leonard (indicating the blanket): Okay, well, um, what about this? What does this mean?", "Penny: Wine, credit card and late night television are a bad combination.", "Leonard: All right, fine. What about that really long hug? What did that mean?", "Penny: That wasn’t a long hug.", "Leonard: It was at least five Mississippis. A standard hug is two Mississippis tops.", "Penny: Leonard, I don’t know what to tell you. It was just a hug.", "Leonard: Glad we cleared that up.", "Penny: Yeah.", "Leonard: I guess I’ll see you.", "Penny: Okay, have a safe trip.", "Leonard: Thank you. Bye.", "Penny: Okay, bye. (Penny closes door. To herself) Means I wish you weren’t going.", "Scene: The North Pole.", "Leonard: Damn it.", "Howard: What?", "Leonard: We’re out of ice.", "Sheldon: All right, men, we begin initial assembly and deployment of the testing equipment starting tomorrow at 0700 hours, but until then, you are all off duty. I suggest you keep the shenanigans to a minimum as medical help is 18 hours away by dogsled.", "Raj: What are you working on?", "Howard: Crossbow.", "Leonard: Hey, guys, can I just say something? How about we take a moment to think about where we are right now? This is literally the top of the world. Only a handful of people in all of human history will ever see what we are going to see.", "Raj: He’s right.", "Howard: Yeah, wow.", "Sheldon: It is remarkable.", "Raj: So, who’s up for a movie?", "Howard: Good idea, what do you think? Ice Station Zebra or John Carpenter’s The Thing?", "Raj: I say double feature.", "Leonard: Dinner’s ready!", "Sheldon: What are we having?", "Leonard: Reconstituted Thai food.", "Sheldon: Did you bring the dehydrated low-sodium soy sauce?", "Leonard: Check.", "Sheldon: Freeze-dried spicy mustard?", "Leonard: Check.", "Sheldon: Flash-frozen brown rice, not white?", "Leonard: Uh, oh, sorry.", "Sheldon: Not to worry. I hid it. Bazinga! You’re in my spot.", "Howard: There’s no time for a crossbow. Find me an icicle.", "Sheldon: Three months. This is gonna be great!"]}