{"series": "4", "episode": "10", "transcript": ["Scene: The apartment. ", "Sheldon: Clarify something for me. Isn’t the point of a communal meal the exchange of ideas and opinions? An opportunity to consider important issues of the day?", "Leonard: It is. You just kind of put a damper on things when you said, the next person I see talking with food in their mouth will be put to death.", "Sheldon: Well, we could argue about who said what all night long, but to set things back on course, I will propose a new topic of conversation.", "Leonard: Great.", "Sheldon: What is the best number? By the way, there’s only one correct answer.", "Raj: Five million, three hundred eighteen thousand and eight?", "Sheldon: Wrong. The best number is 73. You’re probably wondering why.", "Leonard: No.", "Howard: Uh-uh.", "Raj: We’re good.", "Sheldon: 73 is the 21st prime number. Its mirror, 37, is the 12th, and its mirror, 21, is the product of multiplying, hang on to your hats, seven and three. Eh? Eh? Did I lie?", "Leonard: We get it. 73 is the Chuck Norris of numbers.", "Sheldon: Chuck Norris wishes. In binary, 73 is a palindrome, one-zero-zero-one-zero-zero-one which backwards is one-zero-zero-one-zero-zero-one, exactly the same. All Chuck Norris backwards gets you is Sirron Kcuhc.", "Raj: Just for the record, when you enter five million three hundred eighteen thousand and eight in a calculator, upside-down it spells boobies.", "Leonard: Remember when you were wondering why the girls didn’t want to eat with us tonight?", "Howard: Yeah, I get it now.", "Scene: A bar.", "Penny: I love your little heart locket, Bernadette.", "Bernadette: Oh, thanks. Howard gave it to me. It’s the cutest thing. Every time I have dinner with his mom, the next day I get jewellery.", "Amy: Did you know that the iconic Valentine’s heart shape is not actually based on the shape of a human heart, but rather on the shape of the buttocks of a female bending over?", "Penny: Oh, so I spent seventh grade dotting my I’s with little asses? Cool.", "Zack: Hey, Penny, how’s it going?", "Penny: Hey, Zack, what are you doing here?", "Zack: My dad’s company prints the menus for this place. I’m just dropping off some new ones laminated. Makes ’em easier to clean if people throw up on ’em. Guess how I got the idea?", "Penny: Yeah, I got it, I got it. Uh, Zack, these are my friends Bernadette and Amy.", "Bernadette: Hi.", "Zack: Hey.", "Amy: Hoo.", "Zack: Okay, well, it was good to see you.", "Penny: Yeah, you, too.", "Bernadette: He’s really cute. How do you know him?", "Penny: Oh, we went out a couple of times.", "Amy: I’m often flummoxed by current slang. Does went out mean had intercourse?", "Bernadette: Yes.", "Penny: No, no. But in this case, yes.", "Amy: Interesting. And was it not satisfactory?", "Penny: No, it was great. He just didn’t really challenge me on an intellectual level.", "Bernadette: Couldn’t you just fool around with him and then listen to NPR?", "Penny: Wouldn’t help. Zack can’t even spell NPR.", "Bernadette: It’s what I do with Howard. I’m much smarter than he is. But it’s important to protect his manhood.", "Amy: Hoo.", "Bernadette: What’s the matter?", "Amy: I’m suddenly feeling flushed. My heart rate is elevated, my palms are clammy, my mouth is dry. In addition, I keep involuntarily saying hoo.", "Penny: Oh, we know what’s causing that, don’t we?", "Amy: It’s no mystery. I obviously have the flu coupled with sudden-onset Tourette’s syndrome.", "Credits sequence. ", " ", "Scene: The university cafeteria.", "Howard: Did you hear about the accident at the bio lab?", "Leonard: No. What happened?", "Howard: They were injecting rats with radioactive isotopes and one of the techs got bit.", "Raj: Did he get superpowers?", "Howard: No, he got five stitches and a tetanus shot.", "Raj: Oh. Well, that’s disappointing.", "Howard: Why?", "Raj: Well, you get bit by a radioactive animal in a lab, you kind of want to turn into a superhero.", "Howard: Yeah, but who’d want to become Rat-Man?", "Raj: Who wouldn’t? You could zip through a maze in nothing flat, squeeze through really small holes, and shut down restaurants in a single bound. And the best part is, if I were Rat-Man, you could be my sidekick, Mouse Boy.", "Howard: Mouse Boy?", "Raj: You don’t like Mouse Boy? How about, uh, uh, Kid Vermin?", "Howard: First of all, if we had superpowers, I wouldn’t be the sidekick. You’d be the sidekick.", "Raj: Rat-Man is nobody’s sidekick.", "Howard: Leonard, settle this. Of the two of us, who’s the obvious sidekick?", "Raj: Yeah, Leonard, who?", "Leonard: 12 years after high school, and I’m still at the nerd table.", "Scene: Amy’s lab. ", "Sheldon: Aren’t you slicing that man’s brain a little too thin?", "Amy: It’s too thin if I were making a foot-long brain sandwich at Quiznos. For examination under a two-photon microscope, it’s fine.", "Sheldon: Well, you’re the expert. If the correct way to do it is the wrong way, then I yield.", "Amy: Very well. If you die and donate your body to science, I promise to slice your brain like Canadian bacon.", "Sheldon: Thank you.", "Amy: Now, if you’ll excuse me, I have to take my temperature.", "Sheldon: Are you monitoring your circadian rhythms in order to identify your periods of maximum mental acuity? I did that one summer. Ah, youth.", "Amy: No, I experienced some distressing symptoms last night, so I’m checking my vital signs every hour.", "Sheldon: I’d be happy to create a chart and participate in a differential diagnosis.", "Amy: Oh, that sounds like fun.", "Sheldon: All right. What were the symptoms?", "Amy: Elevated heart rate, moist palms, dry mouth and localized vascular throbbing.", "Sheldon: Localized to what region?", "Amy: Ears and genitalia.", "Sheldon: Interesting. Not body parts that usually team up. What about environmental factors? Describe the scene for me.", "Amy: I was sitting in a restaurant with Penny and Bernadette, drinking water, carbonated as it was a special occasion. Penny’s friend Zack stopped by and said hello and I said hoo.", "Sheldon: Who?", "Amy: Zack.", "Sheldon: Then why did you ask?", "Amy: Ask what?", "Sheldon: Who.", "Amy: Zack.", "Sheldon: All right, let’s start over. What did you say when Zack walked in?", "Amy: Hoo.", "Sheldon: Zack.", "Amy: Why do you keep saying Zack?", "Sheldon: Because you keep saying who.", "Amy: I’m not saying hoo now. I said hoo last night.", "Sheldon: And the answer was Zack, correct?", "Amy: There was no question. I simply said hoo.", "Sheldon: All right, I think I have enough to go on. Possible explanations for your symptoms are, in descending order of likelihood, hyperthyroidism, premature menopause, hosting an alien parasite or, and I only include it for the sake of covering absolutely all bases, sexual arousal.", "Amy: Where would I have picked up an alien parasite?", "Scene: The cafeteria. ", " ", "Howard: There you are.", "Raj: Oh, hey.", "Howard: Let me ask you a question. What are you most afraid of?", "Raj: I don’t know. Um, nuclear war. Accidentally being buried alive. Any of those movies where you get that phone call that says you’re going to die, and then you do.", "Howard: No. Something very specific that we both know you, Rajesh Koothrappali, are terrified of.", "Raj: Well, type two diabetes runs in my family. The thought of losing a toe…", "Howard: Spiders! You’re afraid of spiders!", "Raj: What the heck is this?", "Howard: A jar with a big spider in it, of course. Bravery test. First one to take his hand out is the sidekick.", "Raj: Are you crazy?", "Howard: Perhaps. Are you scared?", "Raj: No. But it’s a stupid test.", "Howard: Oh, really? What if the earth was in danger and the only way to save it was to stick your hand in a jar with a spider?", "Raj: Oh, yeah? What if the earth was in danger and the only way to save it was to take a shower in the locker room and let other guys see you naked?", "Howard: Oh, come on. That’s never gonna happen. Now put your hand in the jar or forever be revealed as my sidekick.", "Raj: All right, I will.", "Howard: How did you get so brave all of a sudden?", "Raj: It’s easy. The spider’s crawling up your arm.", "Howard: Get it off! Get it off! Please, Raj! Ah! Ah! Ah! Please. Oh!", "Scene: Amy’s lab. ", "Amy: My blood work shows thyroid function normal. Cortisol levels normal.", "Sheldon: How about your follicle-stimulating hormone levels?", "Amy: Sheldon, I am not going through menopause.", "Sheldon: Are you sure? You said that with the testy bark of an old biddy.", "Amy: I think we need to face the cold, hard truth, I was sexually aroused by Penny’s friend Zack.", "Sheldon: Hang on. I don’t know that we’ve given the alien parasite hypothesis a fair shake.", "Amy: Let’s look at this logically. I have a stomach, I get hungry. I have genitals, I have the potential for sexual arousal.", "Sheldon: A cross we all must bear. You know, in difficult moments like this, I often turn to a force greater than myself.", "Amy: Religion?", "Sheldon: Star Trek. Did you see Star Trek: The Motion Picture?", "Amy: No.", "Sheldon: Don’t. It’s terrible. However, in it, we learn that when Spock finds himself drawn off the path of logic by feelings bubbling up from his human half, he suppresses them using the Vulcan mental discipline of Kolinar.", "Amy: Are you suggesting we live our lives guided by the philosophies found in cheap science fiction?", "Sheldon: Cheap science fiction?", "Amy: What are you doing?", "Sheldon: Using Kolinar to suppress my anger at that last comment.", "Amy: Is it possible that your concern for me at this moment is motivated by nothing more than simple jealousy?", "Sheldon: I hadn’t considered that. Give me a moment. All right, I’ve considered it.", "Amy: And?", "Sheldon: I reject it.", "Amy: You reject it because you don’t feel jealousy, or because you are suppressing jealousy?", "Sheldon: I think I’ll eat my lunch at home.", "Amy: That’s not your lunch, Sheldon, those are the cadaver brain specimens.", "Sheldon: Oh. As they were incorrectly sliced, you can see how I could mistake them for my sashimi.", "Scene: The laundry room.", "Sheldon: Hello.", "Penny: Hey. Isn’t tomorrow your usual laundry night?", "Sheldon: The supermarket was out of my regular fabric softener. If this one under or over-softens, I’ll need time to make things right.", "Penny: That’s thinking ahead.", "Sheldon: The alternative would be to think backwards. And that’s just remembering.", "Penny: So how’s Amy?", "Sheldon: Amy’s changed. I might have to let her go.", "Penny: Oh, no. Why?", "Sheldon: I thought she was a highly evolved creature of pure intellect, like me. But recent events indicate that she may be a slave to her baser urges. Like you.", "Penny: Just going to skip over that insult.", "Sheldon: What insult?", "Penny: Yeah. That’s why I’m going to skip over it. Are you saying that Amy is, oh, what’s the", "scientific word?", "Sheldon: Forget science. She’s horny.", "Penny: Oh! Okay. Wow.", "Sheldon: It’s simple biology. There’s nothing I can do about it.", "Penny: Are you sure?", "Sheldon: What are you suggesting?", "Penny: I’m suggesting there might be something you could do about Amy’s urges?", "Sheldon: It’s illegal to spay a human being.", "Penny: Yeah. That’s not what I had in mind.", "Sheldon: Oh. Oh! You mean something I could do.", "Penny: Exactly.", "Sheldon: Well, I was hoping to avoid this. But I might as well get it over with. Thank you, Penny. I’ll let you know what happens.", "Penny: Oh, Amy, you lucky girl.", "Scene: The apartment. Sheldon is on the phone.", "Sheldon: Yes. This is Dr. Sheldon Cooper. Is this the Zack Johnson who used to have coitus with my neighbour Penny? Sorry to bother you. Hello. I’m looking for a Zack Johnson who used to have coitus with my neighbour Penny. Coitus. It means intercourse. And I have a feeling I’m speaking to the right Zack. This is Sheldon Cooper. Fine. Shelly. Yes, that does sound like a girl’s name. No, it doesn’t bother me. Yes, Smelly Shelly does bother me. Let me tell you why I’m calling. I’d like to know if you’d be interested in having sex with Amy Farrah Fowler. Amy Farrah Fowler. Yes, that is a girl’s name. Good grief. It’s like trying to talk to a dolphin.", "Scene: A gymnasium. ", "Leonard: Really? This is going to decide who’s the hero and who’s the sidekick?", "Howard: You got a better idea?", "Leonard: Every idea is better than this idea.", "Howard: Ding!", "Raj: Wait. What the hell is ding?", "Howard: It’s a bell.", "Raj: I don’t think this kind of wrestling has a bell.", "Howard: Fine. How do you want to start?", "Raj: I say, uh, how about one, two, three, go?", "Howard: One-two-three-go? That’s for babies.", "Raj: Okay, how about, uh, on your mark, get set, go?", "Howard: That’s for a footrace. If you want to race, we have to go outside.", "Raj: No, it’s chilly outside. Didn’t bring my jacket.", "Howard: Oh, for crying out loud. What kind of superhero needs a jacket?", "Raj: What kind of superhero says dibs on the red tights, dibs on the red tights.", "Howard: All right, how about this? Ready, wrestle.", "Raj: Wait. Are we starting now? Or is that what you’re going to say when we do start, or…", "Howard: We’re starting now!", "Raj: Don’t yell at me!", "Leonard: Suppose there are worse ways to spend a Friday night. None come to mind.", "Scene: A bar.", "Sheldon: Look at this stamp. On what authority are they permitted to mutilate patrons as they enter?", "Amy: I’m sure it’ll wash off.", "Sheldon: Little comfort tonight. I look like a Hell’s Angel.", "Amy: There’s Zack.", "Sheldon: Are you sure this is what you want to do?", "Amy: It’s not what I want to do, it’s what I have to do.", "Sheldon: Go, Amy Farrah Fowler. Follow your endocrine system.", "Amy: Thank you, Sheldon. You’re a good friend.", "Sheldon: Please don’t drag this out. This is never going to come off.", "Amy: Excuse me? Zack? I am Amy Farrah Fowler. We met the other night. I have spent my life in pursuit of pure knowledge. Until I met you, my decisions were founded in logic and reason. And yet here I stand before you, 130 pounds of raging estrogen, longing to grab hold of your gluteus maximus and make Shakespeare’s metaphorical beast with two backs.", "Zack: My gluteus what?", "Amy: On the other hand, as I look at the blank, ape-like expression on your face, I have decided to adopt the Vulcan practice of Kolinar. Good-bye, Zack.", "Zack: Bye. Hoo. That should hold me for a while.", "Scene: The gymnasium.", "Howard: I’m legally obligated to inform you that I took a karate lesson when I was 11. I’d be a regular ninja by now if my mom could’ve arranged a carpool.", "Raj: Oh, yeah? Well, I’ve been taking Pilates class at the rec center, and my abs look like sections of a Hershey bar.", "Howard: Oh, yeah? Won’t matter, you’re going down!", "Raj: No, uh-uh, you’re going down!", "Howard: If anybody’s going to go down, it’s going to be you.", "Leonard: Fellas. It’s been 30 minutes. Nobody’s touched each other.", "Scene: A street. ", "Sheldon: I’m glad you decided to reject your animal hindbrain and return to the realm of pure intellect.", "Amy: As am I. (Holds Sheldon’s hand)", "Sheldon: What are you doing?", "Amy: An experiment. Nope. Nothing. Never mind.", "Scene: The gymnasium. ", "Raj: You realize you can’t win.", "Howard: I prefer to think that I can’t lose.", "Raj: You’re wrong. It’s only a matter of time before you fall into Rat-Man’s rat trap.", "Howard: You pathetic fool! If there were a rat-catcher, wouldn’t it catch Rat-Man?", "Raj: Just because I didn’t express myself well doesn’t mean my underlying point was invalid! You bloviating buffoon!", "Howard: You narcissistic nincompoop!", "Raj: You crimson coward! Oh, Leonard, wake up, you’re missing some very excellent superhero quips."]}