{"series": "4", "episode": "16", "transcript": ["Episode begins with a “Previously on” sequence before first scene.", "Scene: Bernadette’s bedroom.", "Howard: What’s so funny?", "Bernadette: Nothing. Just thinking about the noises people make during sex.", "Howard: I do sometimes get a bit carried away, don’t I?", "Bernadette: It’s cute. You sound a little like a drunken monkey. Ooh-ooh-ooh-ooh!", "Howard: You know it’s meant as a compliment.", "Bernadette: That’s how I take it.", "Howard: This is perfect. I hope this moment never ends.", "Bernadette: Me too.", "Howard: Well, gotta go.", "Bernadette: Oh! Already? Why don’t you stay over?", "Howard: Well, I’d love to, but you know my mother needs me in the morning.", "Bernadette: Please, I think the woman can manage to put a wig on by herself.", "Howard: It’s not just the wig. It’s pinning her hair up, drawing on her eyebrows. It’s a two-person job.", "Bernadette: It’s just, when you leave right after we make love, it makes me feel cheap.", "Howard: Oh, honey, I’m sorry. What can I do?", "Bernadette: Stay.", "Howard: Okay. Like, what, another five, ten minutes?", "Bernadette: Go home.", "Howard: Your call.", "Bernadette: Howard, have you ever considered us living together?", "Howard: Boy, I don’t know. You, me, Ma living under the same roof?", "Bernadette: No, I mean just you and me. You can move in here, or we can find a place.", "Howard: I’ve got a better solution.", "Bernadette: What?", "Howard: We wait for my mom’s heart to explode from all the salt she eats. Then we just stick her in the ground, flip her mattress and move into the big bedroom.", "Bernadette: Great.", "Howard: Look at us planning a future together.", "Scene: Outside Howard’s house.", "Mrs Wolowitz (voice): Who’s there? Are you a sex criminal?", "Howard: Sex criminals don’t have keys, Ma.", "Mrs Wolowitz: Where were you so late?", "Howard: I was out with Bernadette.", "Mrs Wolowitz: I know what that means, I watch Dr. Phil. I hope to God you used a condom!", "Howard: I’m not having this conversation with you, Ma!", "Mrs Wolowitz: God forbid you get one of those new fancy sex diseases!", "Howard: Nobody has a disease!", "Mrs Wolowitz: I hope not. I share a toilet with you. Is that what you want? To give your mother herpes?", "Howard: That’s it. I don’t have to take this. Good luck with your eyebrows in the morning!", "Mrs Wolowitz: Who’s there? Are you a sex criminal?", "Howard: I’m still leaving! I just forgot my Claritin.", "Credits sequence.", " ", "Scene: The apartment.", "Leonard: Hey, what’s up?", "Howard: I need a place to crash.", "Leonard: Uh, sure. Why?", "Howard: Big fight with my mother.", "Leonard: Still arguing over which CSI is the best?", "Howard: No, we agreed they all have their merits. This was about Bernadette.", "Sheldon: What’s going on?", "Leonard: Howard’s gonna sleep here tonight. He had a fight with his mother.", "Sheldon: Did you offer him a hot beverage?", "Leonard: No.", "Sheldon: Leonard, social protocol states when a friend is upset, you offer them a hot beverage, such as tea.", "Howard: Tea does sound nice.", "Sheldon: You heard the man, Leonard. And while you’re at it, I’m upset that we have an unannounced houseguest, so make me cocoa. Point of inquiry, given that Leonard is your secondary friend and Koothrappali is your primary friend, why didn’t you seek refuge under his roof?", "Howard: There’s no room. His sister is staying with him.", "Leonard: Wait, wait. What?", "Sheldon: Cocoa, Leonard. Focus. I’m down in the dumps here.", "Leonard: Priya’s in town?", "Howard: Yeah, some work thing. Anyway, my mother seems to think that Bernadette…", "Leonard: Hold on. When did Priya get here?", "Howard: I don’t know. A couple of days ago. The thing is, Bernadette doesn’t like that I have to take care of my mother, and my mother doesn’t trust Bernadette.", "Leonard: Yeah, that’s a real pickle. Bye.", "Sheldon: Don’t worry. As your tertiary friend, I am prepared to step in and comfort you.", "Howard: That’s not really necessary.", "Sheldon: No, no. I’ll finish making the tea, while you narcissistically ramble on about whatever’s troubling you.", "Howard: Thanks.", "Sheldon: That’s what tertiary friends are for.", "Scene: Raj’s Apartment. Leonard knocks on the door. ", "Raj (inside): Who is it?", "Leonard: It’s Leonard.", "Raj: You can’t come in.", "Leonard: I just want to talk to her.", "Raj: I forbid it.", "Priya: Open the door, Rajesh.", "Raj: You heard me. I forbidded it.", "Priya: Forbidded it?", "Raj: Forbaded it?", "Priya: Get out of the way. What are you doing here?", "Leonard: What are you doing here?", "Priya: I have business in Los Angeles.", "Leonard: Why didn’t you call?", "Raj: Clearly, she was sending you a message to take a hike, Mike.", "Priya: I’m sorry. I thought about calling, but I just wasn’t sure if seeing you was such a good idea.", "Leonard: I know. Last time I came on too strong. Can we talk in private?", "Raj: No!", "Priya: Sure.", "Raj: It’s completely inappropriate for a single woman to entertain a man in private. If you insist on talking, you must do it on the couch! All right, you may talk in the bedroom, but I want this door to remain open! All right, just this once you may close the door. But keep in mind I’ll be right out here monitoring the situation! (Dials phone) Oh, damn it. Leonard, when you get this message, call me. (Dials again) Priya, this is your brother. When you get this, tell Leonard to check his voicemail.", "Scene: The Cheesecake Factory.", "Sheldon: Would you be sleeping over again this evening? Because you’re welcome to.", "Howard: That’s very nice of you, but I made other plans.", "Sheldon: Well, just keep in mind that should you ever need a slightly apathetic tertiary friend, I stand at the ready.", "Priya: Hi, Howard. Hi, Sheldon.", "Howard: Hey.", "Sheldon: Hello.", "Raj: Why are you holding hands? I forbid you to hold hands.", "Priya: Rajesh, you know Leonard and I spent the night together.", "Raj: Yeah, but you were just sleeping, because I forboded you to have sex.", "Leonard: The word is forbade.", "Raj: Are you sure? That doesn’t sound right.", "Priya: Listen, Rajesh, Leonard and I have decided to see each other again, and you don’t get to tell me who I can and can’t have a relationship with.", "Sheldon: Actually, he can. The Hindu Code of Manu is very clear in these matters. If a woman’s father is not around, the duty of controlling her base desires falls to the closest male member of her family, in this case, Raj. The code also states that if she disobeys, she will be reborn in the womb of a jackal and tormented by diseases. If true, that seems like an awfully large gamble given that the prize is Leonard.", "Raj: There it is, Priya. We’re Indian. We believe this stuff.", "Priya: I think it also says that if you eat beef, you need to live with cows for three months and drink their urine.", "Raj: Some of it makes sense, some of it’s crazy. My point is, you can’t go out with Leonard.", "Penny (arriving): Who can’t go out with Leonard?", "Raj: My sister.", "Leonard: Penny, this is Raj’s sister, Priya.", "Priya: It’s very nice to meet you.", "Penny: Oh, yeah, you, too.", "Sheldon: Priya, if you’re experiencing any tension or awkwardness, it may stem from the fact that Leonard and Penny used to, if I may quote Howard, do the dance with no pants.", "Penny: Sheldon!", "Leonard: Really?", "Howard: Hey, Bernadette, can I talk to you for a second?", "Bernadette: Sure.", "Raj: Penny, you became disenchanted with Leonard as a lover. Would you please tell my sister why?", "Howard: Listen, my mom’s going to Palm Springs to visit her sister. That’s two whole nights in a row I can sleep over with you all the way to morning. Unless the desert air dries out her sinuses, in which case I’ll have to schlep out there with the big humidifier.", "Bernadette: That’s it? That’s your big solution to all of our problems? If your mom’s nose holds up, we get two nights together?", "Howard: Isn’t that great?", "Bernadette: No, it’s not great. You need to make a choice. Me or your mother.", "Howard: Oh, uh…", "Bernadette: Wrong answer.", "Howard: No, wait. You didn’t let me finish.", "Bernadette: I’m listening.", "Howard: Uh…", "Bernadette: Agh!", "Scene: Penny’s apartment. (groans)", "Amy: I came as quickly as I could.", "Penny: Okay. Why?", "Amy: To comfort you, of course. Sheldon told me about Leonard dating Rajesh’s sister. So I high-tailed it over here to pick up the pieces of your broken heart.", "Penny: Amy, I’m fine.", "Amy: You don’t have to be strong for me. Now let’s talk about Priya, that man-stealing bitch.", "Penny: What?", "Amy: In situations like this, best girlfriends are often catty about the other woman. Rawr.", "Penny: Really, I am not upset about Leonard and Priya.", "Amy: Oh. Then perhaps you don’t understand what’s going on. Your former boyfriend has replaced you with what appears to be a very suitable mate. Arguably much more suitable than you.", "Penny: Oh. Well, good for him. Hey, what do you mean, more suitable?", "Amy: Well, granted, Penny, your secondary sexual characteristics are reasonably bodacious. But Priya is highly educated, she’s an accomplished professional, and she comes from the culture that literally wrote the book on neat ways to have sex. Whereas you, on the other hand, are a community college dropout who comes from the culture that wrote the book on tipping cows.", "Penny: Yeah. Okay, I got it. I got it. So, what is all that stuff?", "Amy: This is a portable electroencephalogram. I’m doing research on emotions and brain activity. So when you start crying, I can see which region of the brain is activated. Then I’m going to stimulate the analogous area in the brain of a rhesus monkey and see if he cries. Cool, huh?", "Scene: Bernadette’s apartment. Howard knocks on door.", "Howard: I choose you.", "Bernadette: Really?", "Howard: Yep. I moved out of my mother’s house. Cord is cut. I’m all yours.", "Bernadette: What did she say when you told her?", "Howard: I don’t know. She hasn’t responded to my email yet.", "Bernadette: This is so great. I love you, Howard.", "Howard: I love you, too. So what’s for dinner?", "Bernadette: Well, I don’t really have much of anything in the house.", "Howard: That’s fine. Why don’t we go fool around in our bedroom? And then you can go shopping.", "Scene: The apartment. ", "Leonard: I thought maybe after we eat, we could see an early movie.", "Priya: I’d love that.", "Leonard: I love the way you say, I’d love that.", "Raj: She says it the same way I do. I’d love that. Everybody in India says it that way. It’s not a big deal.", "Priya: Rajesh, don’t be a child.", "Raj: I’m not being a child. Leonard, I swear to God, if your sister ever comes to town, I shall have my way with her.", "Leonard: My sister’s 38 and married.", "Raj: All the more shame that will fall upon the house of Hofstadter.", "Penny: Ooh, I thought I smelled pizza.", "Sheldon: That’s remarkable. If pepperoni were an explosive substance, you could replace German shepherds at our nation’s airports.", "Priya: Hi. Penny, right?", "Penny: Oh, yes. Hi, hi. I’m sorry. I didn’t know you had company. I don’t want to impose.", "Sheldon: No, no. It’s not an imposition. At this point, in our ecosystem, you are akin to the plover, a small scavenging bird that eats extra food from between the teeth of crocodiles. Please, fly into our open maw, and have at it.", "Penny: If I had more than a box of baking soda in my refrigerator, I wouldn’t have to take that.", "Amy: Hi, bestie.", "Penny: Hi. So, um, Priya, you’re a lawyer, right?", "Priya: I know. Pretty boring, huh?", "Leonard: Oh, come on. It’s not boring at all. She’s currently helping set up a secondary derivative market which would allow overseas car firms to hedge their investments against potential advancements in battery technology. Hmm?", "Priya: Thank you, Leonard. That doesn’t make it sound boring at all.", "Amy: So, how you holding up?", "Penny: I’m fine.", "Amy: Oh, who are you kidding? She’s breathtaking.", "Priya: So, Penny, Leonard tells me you’re an actress. That must be pretty exciting.", "Penny: Oh, yeah, yeah. It’s real great. Today I drove to Van Nuys for an audition I thought was going to be for a cat food commercial. Turned out to be porn.", "Sheldon: Did you get the part?", "Penny: I didn’t do the audition.", "Sheldon: Given the state of your career, can you really afford to be picky?", "Priya: I took acting classes when I was at Cambridge. I loved it. We did Taming of the Shrew.", "Leonard: Oh, wow. I love Taming of the Shrew. I did a paper on it in high school. Who knows not where a wasp does wear his sting? In his tail.", "Priya: In his tongue.", "Leonard: Whose tongue?", "Priya: Yours, if you talk of tails, and so farewell.", "Leonard: What, with my tongue in your tail?", "Amy: I’m regretting my earlier cattiness. She is an absolute delight.", "Scene: Bernadette’s bedroom. ", "Bernadette: Wow.", "Howard: Wow, indeed.", "Bernadette: I can’t believe we’re finally living together.", "Howard: Yeah. You know what would make this moment perfect?", "Bernadette: What?", "Howard: A little snack. You got any string cheese?", "Bernadette: No. I, I might have some cheddar.", "Howard: Not as good. You can’t make strings with it. Remind me to put it on your shopping list.", "Bernadette: Okay.", "Howard: You have hypo-allergenic detergent?", "Bernadette: No.", "Howard: Better put it on the list. If you wash my underwear with regular soap, I get little red bumps on my tuchus.", "Bernadette: Wait a second. I’m doing your laundry?", "Howard: Well, honey, it’s not gonna do itself. Oh, before I forget, tomorrow morning, you’re driving me to the dentist.", "Bernadette: I have to take you?", "Howard: You don’t have to take me. You get to take me.", "Bernadette: Wait a minute. Are you telling me your mother usually takes you to the dentist?", "Howard: It’s not weird. There’s lots of kids there with their moms.", "Bernadette: I can’t believe this.", "Howard: What? It’s fun. If I have no cavities, afterwards, we go out for a treat.", "Bernadette: All right, Howard, let’s get something straight right now. I’m not going to be your mother.", "Howard: Whoa, whoa, whoa! Where did that come from?", "Scene: Howard’s house. ", " ", "Mrs Wolowitz (off): Who’s that? Is it a sex criminal?", "Howard: Nobody wants to do that to you, Ma.", "Mrs Wolowitz: Where were you?", "Howard: Didn’t you read my email?", "Mrs Wolowitz: You know I can’t turn on that ferkakta computer. I left you some brisket on the kitchen counter.", "Howard: Thank you.", "Mrs Wolowitz: Remember to floss after. We have the dentist in the morning!", "Scene: Penny’s apartment. ", " ", "Penny: Oh, hey. What’s up?", "Amy: I just wanted to check in on you.", "Penny: Why?", "Amy: It seems like the appropriate thing to do when one’s best friend finds herself replaced by a smart, beautiful woman with the smouldering sexuality of a crouched Bengal tiger.", "Penny: I already told you, I’m okay with it. I mean, if anything, I’m quite pleased (starting to blub) that Leonard has found someone (starting to blub) that makes him so happy.", "Amy: It’s okay, it’s okay.", "Penny: Thank you.", "Amy: Now, let’s get these electrodes attached and see what’s going on in that pretty little noggin of yours.", "Penny: Okay.", "Scene: The apartment. ", "Penny: I smell Chinese food.", "Sheldon: It’s actually Thai. You’re slipping.", "Penny: Are Leonard and Priya here?", "Sheldon: They went to Catalina for the weekend.", "Penny: Oh. Where’s Raj?", "Sheldon: At home, forbidding it.", "Penny: How about Howard?", "Sheldon: I’m given to understand his mother grounded him for running away.", "Penny: Oh, okay. Well, I guess it’s just the two of us, huh?", "Sheldon: Actually, it’s the three of us.", "Amy (on webcam): What up, bestie? Good news. Thanks to you, I was able to make a rhesus monkey cry like a disgraced televangelist.", "Penny: Great.", "Amy: So, you feeling better?", "Penny: Not really.", "Amy: Sheldon, you have a guest who’s upset.", "Sheldon: Right. I’ll make tea.", "Penny: Oh, sweetie, it’s okay. I don’t want tea.", "Sheldon: I’m sorry. It’s not optional."]}